[
    {
        "AOTD #": "1",
        "Artist": "2Hollis",
        "Description": "2hollis, born Hollis Frazier-Herndon on January 5, 2004, in Chicago, Illinois, is a 20-year-old artist who’s already pushing boundaries in the world of experimental music. Blending a dizzying mix of EDM, dubstep, trap, hyperpop, cloud rap, and glitchcore, his sound feels like it exists in a space somewhere between chaos and beauty, carving out a unique niche that’s all his own. Raised in Chicago, 2hollis relocated to Los Angeles at age 10, where he began to absorb the city’s eclectic music culture. It’s no surprise then that his work feels global—genre-defying and yet distinctly rooted in the underground music scenes of both coasts. With every track, 2hollis smashes genres together, weaving together complex layers that pull from the worlds of glitch and electronic avant-garde. The result? A sound that feels futuristic, off-kilter, and yet undeniably addictive. His latest album, boy, released in 2024, cemented his place as a rising force in experimental music. With tracks that shift between emotional vulnerability and hard-edged electronic beats, 2hollis doesn’t just write songs—he crafts experiences. The album’s acclaim proves that this is more than just an artist experimenting with sound; this is someone shaping a new era of music, where boundaries don’t just blur—they disappear entirely. Visually, 2hollis doesn’t shy away from making a statement either. With his signature blonde hair and Rick Owens-inspired fashion, he’s as much a part of the fashion and art world as he is of music. His online presence resonates with a fanbase that feels connected to him on a deeply personal level, and his ability to engage with fans only adds to his mystique. 2hollis is more than a musician; he’s an artist who’s redefining what it means to create in a world where the only limit is your imagination. Whether through his genre-defying beats, his fashion-forward looks, or his deep connection with fans, 2hollis is here to stay, and he’s just getting started.",
        "Genres": "Rap, Hyperpop, Experimental",
        "Scheduled": "Thursday",
        "Stage": "That Tent",
        "StartTime": "10:30 PM",
        "EndTime": "11:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "2",
        "Artist": "Action Bronson",
        "Description": "Action Bronson, born Ariyan Arslani on December 2, 1983, in Flushing, Queens, New York, is a multifaceted American artist renowned for his contributions to hip-hop, culinary arts, and television. Of Albanian and Jewish descent, Bronson’s early life was steeped in the rich cultural tapestry of Queens, a borough celebrated for its diversity and artistic vibrancy. Before embarking on his musical career, Bronson was a respected chef in New York City, a profession that deeply influenced his lyrical content, often infused with culinary references. His transition from the kitchen to the recording studio was catalyzed by a sports injury, leading him to focus on music. Bronson’s musical journey began with the release of his debut mixtape, Dr. Lecter, in 2011, which garnered attention for its intricate wordplay and vivid storytelling. He continued to build his discography with albums such as Blue Chips (2012), Mr. Wonderful (2015), and Only for Dolphins (2020), each showcasing his unique blend of humor, culinary imagery, and diverse musical influences. Beyond music, Bronson has made notable appearances in film and television, including roles in The King of Staten Island (2020) and Suicide Squad (2016). He also gained acclaim as the host of the culinary travel show Fck, That’s Delicious*, where he explored global cuisines, further highlighting his passion for food. Action Bronson continues to be a dynamic figure in the entertainment industry, seamlessly blending his culinary expertise with his musical and television endeavors, and maintaining a dedicated fan base worldwide.",
        "Genres": "Rap, Hip-Hop",
        "Scheduled": "Saturday",
        "Stage": "That Tent",
        "StartTime": "5:45 PM",
        "EndTime": "6:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "3",
        "Artist": "Ahee",
        "Description": "AHEE, the DJ and producer who has redefined the electronic music landscape, embodies the bold energy and genre-defying sound of modern bass music. Born Chris Adams, the California-based artist has made an indelible mark on the electronic music scene with his ability to blend everything from dubstep to psybass and drum and bass, creating an exhilarating ride that resonates with listeners worldwide. As a driving force in the bass music world, AHEE has performed at some of the most prestigious festivals, including Lightning In A Bottle, Coachella, and beyond, ultimately making the transition from festival-goer to headliner. AHEE’s roots in music run deep, and his love for bass culture and festivals was ignited after college. It was at these large gatherings that he discovered the power of immersive soundscapes, an influence that would soon guide his artistic evolution. What began as a fascination with festival culture quickly blossomed into a thriving career. Through the Lucent Dossier Experience, a renowned and forward-thinking performance art collective, AHEE solidified his place as an electrifying live performer. His meteoric rise in the bass scene didn’t stop there. With his releases on prominent labels such as Gravitas, Wakaan, Subsidia, and Cyclops, AHEE has proven himself as an artist who is not only adaptable to different subgenres but also able to infuse his tracks with signature sounds that set him apart. Whether it’s pulsating beats or hypnotic bass lines, his music takes listeners on an unexpected journey, constantly pushing the boundaries of what electronic music can be. AHEE’s influence is further evidenced by his immense online presence, including over a million views on YouTube. His fan base continues to grow as he captivates audiences with his electrifying live performances, bringing raw energy and an unforgettable atmosphere to every show. With each release, AHEE affirms his place as one of the most exciting and innovative forces in the bass music community, and it’s clear that the world is just beginning to witness the full breadth of his talent.",
        "Genres": "EDM, DJ, Bass, Dubstep, Experimental, Drum N Bass",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "3:45 PM",
        "EndTime": "4:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "4",
        "Artist": "Alex Warren",
        "Description": "Alex Warren, born September 18, 2000, in Carlsbad, California, is a multifaceted talent whose journey from social media influencer to musician has captured the attention of a global audience. Best known for his engaging content across YouTube, TikTok, and Instagram, Warren first gained prominence as a co-founder of the viral collaborative TikTok group The Hype House. His charismatic personality and ability to connect with fans quickly made him one of the most recognizable names in the world of digital content creation. In June 2021, Warren made the bold transition into music with the release of his debut single, “One More I Love You,” showcasing a sound that blends indie pop with modern pop influences. The track resonated with listeners, highlighting his natural gift for melody and heartfelt lyricism. It wasn’t just a step into a new realm; it was a statement that Warren was here to stay as a musician. 2022 marked a pivotal moment in his career when Warren signed with Atlantic Records, an endorsement of his musical potential that opened the door for future projects. Alongside his music, Warren also launched the “Locked in with Alex Warren” podcast, further expanding his reach and proving his versatility as a creator. Whether it’s through his infectious online presence or his growing music career, Alex Warren’s ability to connect with his audience is undeniable. Warren’s trajectory from social media sensation to respected artist underscores his adaptability and commitment to his craft. As he continues to evolve and experiment with his music, there’s no doubt that Alex Warren’s creative journey is one worth following.",
        "Genres": "Indie Pop",
        "Scheduled": "Sunday",
        "Stage": "That Tent",
        "StartTime": "3:00 PM",
        "EndTime": "3:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "5",
        "Artist": "Alexandra Kay",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "Which Stage",
        "StartTime": "1:15 PM",
        "EndTime": "2:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "6",
        "Artist": "Aly & AJ",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "What Stage",
        "StartTime": "3:00 PM",
        "EndTime": "3:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "7",
        "Artist": "Arcade Fire's \"Santa Pirata\"",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "That Tent",
        "StartTime": "1:00 AM",
        "EndTime": "2:15 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "8",
        "Artist": "ATLiens",
        "Description": "ATLiens, the enigmatic electronic duo from Atlanta, Georgia, has been steadily making their mark on the EDM world with a sound that is as mysterious as it is captivating. With their signature bass-driven, trance-inducing music, they’ve managed to carve out a space in the bass and trap scenes, garnering support from some of the biggest names in the industry, including Skrillex, RL Grime, Diplo, and Jack Ü. Known for their masked personas and extraterrestrial-themed performances, ATLiens offers more than just music—they create an immersive experience that transports audiences into another world. Their journey began with the release of the track “Chief,” a bass-heavy anthem that quickly caught the attention of the dance music community. Skrillex played the track at a Boiler Room set, igniting the duo’s rise in the EDM world. This track marked the beginning of a series of releases that would solidify their position in the scene, including collaborations like their 2024 track “Black Sheep” with GG Magree, which showcased their ability to blend dark, pulsating bass with hypnotic melodies. Their music continues to explore the deeper, darker corners of bass music, making them a standout act within the trap and bass genres. ATLiens’ ability to create electrifying, high-energy performances that blend haunting atmospheres with hard-hitting beats has earned them a dedicated global following. Their extraterrestrial influence is more than just a gimmick; it’s a reflection of their approach to music—otherworldly, boundary-pushing, and unapologetically unique. As they continue to evolve and release new music, ATLiens remain at the forefront of the EDM movement, steadily taking listeners on a journey beyond the stars.",
        "Genres": "EDM, DJ, Bass, Trap",
        "Scheduled": "Sunday",
        "Stage": "The Other",
        "StartTime": "5:30 PM",
        "EndTime": "6:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "9",
        "Artist": "Avril Lavigne",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "What Stage",
        "StartTime": "8:15 PM",
        "EndTime": "9:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "10",
        "Artist": "Azzecca",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "The Other",
        "StartTime": "5:15 PM",
        "EndTime": "6:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "11",
        "Artist": "Barry Can't Swim",
        "Description": "Barry Can’t Swim, the moniker of Edinburgh-based producer Joshua Mannie, has quickly become a name to watch in the world of electronic music. With a sound that weaves together the energetic pulse of house, the groove of afrobeat, and the smooth complexity of jazz, Barry Can’t Swim crafts compositions that are as infectious as they are innovative. His journey into music began early, with piano lessons from his grandfather laying the groundwork for his unique style, which blends organic and electronic elements seamlessly. After his debut EP Amor Fati caught the attention of both fans and critics alike, Barry Can’t Swim solidified his reputation with a series of tracks that showcased his signature flair for rhythmic intricacy and genre-blending. Tracks like “Fiorucci Made Me Hardcore” in 2022 brought him even more acclaim, positioning him as an artist whose sound transcends boundaries. His debut album, When Will We Land?, released in 2023, takes this fusion to new heights, featuring collaborations with artists like Greentea Peng and Jitwam. The album’s eclectic mix of electronic genres garnered critical praise for its fresh and bold approach to music, cementing Barry Can’t Swim’s place in the industry. As a producer, Barry Can’t Swim doesn’t just make music; he creates atmospheres, pulling listeners into a world where rhythm and melody tell stories that resonate on a deeply emotional level. With When Will We Land?, he’s proven that he’s not just a DJ or producer, but a force of artistic innovation—a testament to his ability to push the limits of electronic music while keeping things personal and grounded.",
        "Genres": "DJ, EDM, Downtempo, House",
        "Scheduled": "Sunday",
        "Stage": "This Tent",
        "StartTime": "6:00 PM",
        "EndTime": "7:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "12",
        "Artist": "Beabadoobee",
        "Description": "Beabadoobee, born Beatrice Kristi Ilejay Laus on June 3, 2000, in Iloilo City, Philippines, has emerged as a prominent figure in the indie and alternative music scenes. At the age of three, she relocated to London, where she began her musical journey. In 2017, Beabadoobee began recording music under her current moniker. She released her debut EP, Lice, in 2018, followed by Patched Up later that year. Her third EP, Loveworm, was released in 2019, showcasing her evolving sound and songwriting prowess. Her debut studio album, Fake It Flowers, released in October 2020, received critical acclaim for its blend of indie rock and bedroom pop. The album’s success solidified her position in the music industry, leading to her second studio album, Beatopia, released in July 2022. In 2024, Beabadoobee released her third studio album, This Is How Tomorrow Moves, which received positive reviews for its fusion of indie rock with other genres. Beabadoobee continues to captivate audiences with her authentic storytelling and dynamic performances, solidifying her status as a rising star in the indie music community.",
        "Genres": "Indie Rock, Bedroom Pop",
        "Scheduled": "Saturday",
        "Stage": "What Stage",
        "StartTime": "6:15 PM",
        "EndTime": "7:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "13",
        "Artist": "Bebe Stockwell",
        "Description": "Bebe Stockwell, a Boston-born indie artist, has swiftly carved a niche for herself with her rich blend of folk, indie, and pop influences. Starting her musical journey at just six years old with piano and guitar, Stockwell’s craft was nurtured by early mentors and shaped by a unique array of influences—ranging from her bluegrass guitar teacher to indie icons like Regina Spektor and The Lumineers. Her debut single, “Love Me Back,” immediately drew attention for its captivating songwriting and her soulful voice. Stockwell’s music reflects a seamless fusion of storytelling and melody, where every track feels like a personal letter written in the language of sound. Fans of raw emotion, intimate lyrics, and infectious rhythms will find her a refreshing voice in the indie landscape. Her sound remains intimately connected to her roots in the Northeast, yet resonates with listeners worldwide, offering a unique take on love, loss, and self-discovery. As she continues to build her discography, Stockwell’s music promises to expand and evolve, tapping into deeper emotional and sonic realms. In addition to her rich catalog of singles and albums, Stockwell actively engages with her growing community of listeners through social media and live performances. With each song, she invites her audience into her world—a space where vulnerability and creativity meet, resulting in something undeniably special.",
        "Genres": "Indie Pop, Electro Pop",
        "Scheduled": "Friday",
        "Stage": "This Tent",
        "StartTime": "1:00 PM",
        "EndTime": "1:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "14",
        "Artist": "Big Gigantic",
        "Description": "Big Gigantic, the Boulder, Colorado-based duo, has been a cornerstone of the live electronic music scene since their formation in 2008. Comprising Dominic Lalli on saxophone and production and Jeremy Salken on drums, Big Gigantic has carved out a unique niche by blending jazz, hip-hop, funk, and dubstep into an infectious and boundary-pushing sound. Their music is a testament to their genre-defying approach, with each track seamlessly combining sophisticated musicality with an irresistible, danceable energy that’s made them a favorite on the festival circuit. Their breakthrough came with the release of Brighter Future in 2016, an album that encapsulates their mission to unite the world through music and community. Featuring collaborations with a diverse range of artists like Waka Flocka Flame, Logic, Cherub, Griz, and Pell, Brighter Future is a bold statement of Big Gigantic’s ability to transcend genres and bring together people from all walks of life through music. Their distinctive sound, which blends live instrumentation with electronic beats, has earned them critical acclaim and a devoted fan base, as well as a reputation for their high-energy live performances that continue to captivate audiences. Big Gigantic has always been about more than just music—they’re a movement. From their early days in Boulder to their present status as pioneers of live electronic music, they’ve stayed true to their vision of creating moments of joy and connection. With their commitment to pushing musical boundaries, Big Gigantic continues to evolve, and their influence in the scene only continues to grow.",
        "Genres": "EDM, DJ, Saxophone, Bass, Funk",
        "Scheduled": "Sunday",
        "Stage": "The Other",
        "StartTime": "6:45 PM",
        "EndTime": "7:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "15",
        "Artist": "Bilmuri",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "That Tent",
        "StartTime": "4:30 PM",
        "EndTime": "5:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "16",
        "Artist": "Bossman Dlow",
        "Description": "Bossman Dlow, born Devante McCreary on August 31, 1998, in Port Salerno, Florida, represents the new wave of rap, blending motivational themes with an undeniable party energy. Emerging from a family steeped in music, Bossman began experimenting with his sound in his family’s studio, setting the stage for a journey that would shift gears in 2020, when he dropped his first tracks. Dlow’s rise is no accident—his relentless pursuit of authenticity and a distinct voice has caught the attention of both fans and industry insiders. He’s proven his versatility with songs like “Flat,” “I’m Him,” and “Phil Jackson,” each track revealing his ability to merge uplifting messages with an infectious groove. In 2023, Dlow released Too Slippery, a full-length album that pushed boundaries, only to follow it up with 2 Slippery, a companion piece that further solidified his place in the music scene. His music is a reflection of his growth as an artist—unafraid to explore different sonic landscapes while keeping his core sound rooted in hip-hop’s high-energy tradition. Dlow’s storytelling is layered, touching on themes of resilience, self-confidence, and the hustle, often delivered with a swagger that commands attention. His sound, however, isn’t just about the bold bravado; it’s also about celebrating life in the face of challenges, making his music resonate on both an emotional and physical level, inviting listeners to dance while contemplating the deeper messages woven into his verses. As Dlow’s trajectory continues to rise, he stands as a reminder that the future of rap is in the hands of artists who refuse to conform, instead carving out their own space in an ever-evolving musical landscape. For those who haven’t caught on yet, the time is now. Bossman Dlow isn’t just an artist—he’s a movement in the making.",
        "Genres": "Rap, Hip-Hop",
        "Scheduled": "Friday",
        "Stage": "That Tent",
        "StartTime": "5:45 PM",
        "EndTime": "6:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "17",
        "Artist": "Claptone",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "7:30 PM",
        "EndTime": "8:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "18",
        "Artist": "Crankdat",
        "Description": "Christian Smith, professionally known as Crankdat, is an American DJ and electronic dance music producer hailing from Youngstown, Ohio. Born on March 2, 1997, he initially pursued athletics, turning down a full-ride track-and-field scholarship to Kent State University to follow his passion for music. Crankdat’s musical journey began in high school, where he started producing tracks and quickly gained attention for his innovative remixes of popular songs, including Fetty Wap’s “Trap Queen.” These remixes amassed millions of plays, propelling him into the spotlight and earning recognition from industry heavyweights like Skrillex and The Chainsmokers. In 2017, Crankdat released original tracks such as “I Hold Still” in collaboration with Jauz and the triumphant “Dollars,” further establishing his presence in the electronic music scene. He embarked on his ambitious “Gearworld” tour in 2019, showcasing his dynamic performances to audiences worldwide. Crankdat continues to captivate audiences with his energetic and melodically vibrant electronic dance music, solidifying his status as a prominent figure in the EDM community.",
        "Genres": "EDM, DJ, Future Bass, Dubstep, Trap, Drum N Bass",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "12:30 AM",
        "EndTime": "1:45 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "19",
        "Artist": "Cults",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "This Tent",
        "StartTime": "3:45 PM",
        "EndTime": "4:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "20",
        "Artist": "Dadi Freyr",
        "Description": "Daði Freyr Pétursson, known simply as Daði Freyr, has emerged as one of Iceland’s most captivating musical talents, blending infectious pop melodies with a quirky, undeniable stage presence. Born on June 30, 1992, in Reykjavík, Iceland, Daði’s early years saw him moving to Denmark before returning to Iceland at the age of nine. His musical journey began early, as he immersed himself in a variety of instruments—drums, piano, and bass guitar—setting the stage for a career that would ultimately catapult him to international fame. Daði’s commitment to music was solidified when he co-founded the indie pop band RetRoBot, an effort that allowed him to hone his songwriting and performance skills. However, it wasn’t until 2020 that he broke into the mainstream with the viral hit “Think About Things.” The track quickly gained a following, catching the attention of fans around the world, including prominent figures like Russell Crowe and Jennifer Garner. The song’s success paved the way for Daði’s high-profile appearance at the 2021 Eurovision Song Contest, where his entry, “10 Years,” earned widespread acclaim. Known for his whimsical approach to pop music and his endearing, offbeat persona, Daði Freyr has solidified his place on the global music scene. His ability to craft catchy, melody-driven tunes—combined with his energetic and engaging performances—ensures that audiences continue to be drawn to his sound. Whether performing solo or as the frontman of his band, Daði’s live shows offer a refreshing break from the ordinary, marked by an infectious energy and charm. As he continues to evolve as an artist, Daði Freyr remains a bright and innovative force in the world of pop music, earning admiration for his distinct blend of sincerity, humor, and musical creativity. His journey is just beginning, and fans around the globe are eagerly awaiting what’s next from this Icelandic sensation.",
        "Genres": "Electro-Pop, Synth, Indie Pop",
        "Scheduled": "Saturday",
        "Stage": "That Tent",
        "StartTime": "2:45 PM",
        "EndTime": "3:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "21",
        "Artist": "Daniel Donato's Cosmic Country",
        "Description": "Daniel Donato is the kind of artist who doesn’t just play music—he creates worlds with it. Born on April 6, 1995, in Atlantic City, New Jersey, and raised in the heart of Nashville, Tennessee, Donato’s journey to becoming one of the most innovative voices in modern country is a blend of grit, talent, and an unyielding drive to carve out his own sound. Starting his musical life early, Donato picked up the guitar at 12, inspired by Guitar Hero—yes, that video game. But soon, his passion for the instrument turned into something far more profound, and by 14, he was busking on the streets of Nashville, learning the ropes of real-world music while earning enough to invest in better guitars and amps. By 17, he was holding down a regular gig with the Don Kelly Band at Robert’s Western World, honing his skills four nights a week in front of a live audience that would shape his future sound. It wasn’t until 2015 that Donato had his “lightbulb” moment. After catching Sturgill Simpson’s electrifying performance at the Ryman Auditorium, he decided it was time to build his own voice. Drawing from his love of classic country and rock, Donato began blending the improvisational spirit of the Grateful Dead with his deep country roots, coining the genre he calls “Cosmic Country”—a collision of psychedelic rock, roadhouse twang, and cosmic vibes that would define his musical path. By 2023, Donato was not only a household name in the Americana world, but he also had the charts to prove it. His album Reflector spent 29 weeks on the Americana charts, a testament to his live-performance roots and his unique vision of artistry—one that aims to sell a million tickets rather than a million records. His discography, including albums like Starlight (2019) and A Young Man’s Country (2020), has made it clear that he is a force to be reckoned with. Donato’s sound isn’t just influenced by country icons like Merle Haggard and Willie Nelson, but also by legends like the Grateful Dead’s Jerry Garcia and Stevie Ray Vaughan. His collaborations with acts like Billy Strings, Bob Weir, and Widespread Panic show that his musical influence stretches far beyond the confines of genre, merging the worlds of rock, jam, and country in a way that’s all his own. A man of both vision and substance, Donato has also authored The New Master of the Telecaster: Pathways to Dynamic Solos, teaching aspiring guitarists his signature approach to dynamic, soulful playing. Daniel Donato isn’t just a musician. He’s a storyteller, a visionary, and a reminder that country music—when done right—can be as expansive as the cosmos itself.",
        "Genres": "Cosmic Country, Jam Band, Americana",
        "Scheduled": "Thursday",
        "Stage": "This Tent",
        "StartTime": "10:45 PM",
        "EndTime": "11:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "22",
        "Artist": "Destroy Boys",
        "Description": "Destroy Boys are a force of nature in the punk rock scene, a trio that emerged from the vibrant Sacramento music community with a raw sound and unflinching honesty. Formed in 2015 by Alexia Roditis and Violet Mayugba, the band originally began as an acoustic duo while still in high school. Their early work caught the attention of listeners, most notably with their track “I Threw Glass At My Friend’s Eyes and Now I’m On Probation,” which laid bare their rebellious spirit and directness in tackling personal and social issues. When drummer Narsai Malik joined in 2018, the band solidified their signature lineup, marking the beginning of a new phase of musical exploration. Destroy Boys’ sound is undeniably punk, but it’s also layered with elements of pop-punk, grunge, and garage rock, setting them apart from the noise. Their music is as much about introspection as it is about fury, and that balance of raw emotion and vulnerability is a defining trait of their songwriting. Tracks like “Shadow (I’m Breaking Down)” from their latest project Open Mouth, Open Heart show just how deeply the band connects with listeners, with lyrics that hit hard and lyrics that are deeply personal, exploring addiction, love, and mental health. Destroy Boys have established themselves as a band that’s unafraid to show their wounds, but it’s that openness that has garnered them a passionate fanbase. Their unique blend of punk rock energy, infectious hooks, and unapologetic lyricism makes them one of the most exciting acts in the underground music scene today. With their blend of grit and heart, Destroy Boys have proven they’re not just a punk band—they’re an evolving force in the modern rock world.",
        "Genres": "Punk Rock, Garage Rock",
        "Scheduled": "Saturday",
        "Stage": "That Tent",
        "StartTime": "1:30 PM",
        "EndTime": "2:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "23",
        "Artist": "Detox Unit",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "6:30 PM",
        "EndTime": "7:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "24",
        "Artist": "Die Spitz",
        "Description": "Die Spitz, the all-female punk quartet from Austin, Texas, have been lighting up the scene with a sound that’s unapologetically raw and fiercely energetic. Formed in 2022, the band consists of Ava Schrobilgen (vocals/guitar), Chloe Andrews (guitar), Ellie Livingston (bass), and Kate Halter (drums). In less than a year, they’ve managed to shake up the punk landscape with a visceral, in-your-face style that blends chaotic energy with a potent political edge. Their sound? It’s punk in its truest form—loud, aggressive, and relentlessly direct. Their debut EP, Teeth (2023), embodies their ethos: no holds barred, tackling controversial topics with unflinching honesty. Tracks like “Monkey Song” challenge blind trust in political and religious figures, while “Groping Dogs Gushing Blood” dives deep into the complexities of womanhood, pushing the envelope with bold statements and fierce anger. Each song is a burst of unrelenting intensity, a reflection of their commitment to confronting difficult themes through the lens of punk rock. Die Spitz’s live performances are as explosive as their music. Their unruly stage presence, coupled with a wall of sound that hits with youthful moxie, has earned them a reputation for shows that are as unpredictable as they are thrilling. It’s not just about the music—it’s an experience that’s meant to be felt in the pit, with no apologies and no backing down. In 2023, the band’s efforts were recognized with three Austin Music Awards: Best Punk Band, Best Music Residency, and Best New Act. They’ve shared stages with heavy hitters like Amyl and the Sniffers, Sleater-Kinney, and OFF!, proving that they’re not just a local sensation—they’re a rising force in the punk scene. With their bold sound and fearless attitude, Die Spitz are carving out their own space in the world of punk. Their music isn’t just for the faint of heart—it’s for those ready to challenge the status quo and embrace the chaos of it all.",
        "Genres": "Punk Rock, Post Punk",
        "Scheduled": "Thursday",
        "Stage": "This Tent",
        "StartTime": "3:00 PM",
        "EndTime": "3:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "25",
        "Artist": "Dispatch",
        "Description": "Dispatch, the American indie/roots band, has been a cornerstone of the indie music scene since their formation in 1996. Originating from Middlebury, Vermont, the trio—Chad Urmston, Brad Corrigan, and Pete Heimbold—crafted a unique blend of acoustic folk-rock, reggae, and funk. Their early performances, notably at Middlebury College, showcased their versatility and set the stage for their expansive sound. In 2002, Dispatch announced an indefinite hiatus following a performance on The Late Late Show with Craig Ferguson. This hiatus lasted nearly a decade, during which the band members pursued individual projects. However, their bond with their audience remained unbroken. In 2011, Dispatch reunited, releasing new material and embarking on a national tour, reaffirming their enduring connection with fans. Throughout their career, Dispatch has been celebrated for their genre-blending style, seamlessly integrating elements of reggae, flamenco, funk, ska, folk, rock, and rap. This eclectic mix has not only defined their sound but also set them apart in the indie music landscape. Beyond their musical endeavors, Dispatch has demonstrated a commitment to social causes. The song “Elias,” inspired by Urmston’s experiences in Zimbabwe, led to the creation of the Elias Fund in 2005, aiming to provide hope and opportunity to Zimbabwean youth through community development and education. As of 2024, Dispatch continues to captivate audiences with their dynamic performances and socially conscious music, solidifying their legacy as a pivotal force in the indie music scene.",
        "Genres": "Indie Rock, Acoustic, Roots",
        "Scheduled": "Sunday",
        "Stage": "That Tent",
        "StartTime": "8:00 PM",
        "EndTime": "9:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "26",
        "Artist": "Dogs in a Pile",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "This Tent",
        "StartTime": "7:45 PM",
        "EndTime": "8:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "27",
        "Artist": "Dom Dolla",
        "Description": "Emerging from the vibrant tapestry of Australia’s dance music scene, Dom Dolla has swiftly ascended to international acclaim with his infectious house tracks and electrifying performances. Born Dominic Matheson in Manila, Philippines, and raised in the rugged expanses of Northern Australia, Dom’s journey into music was serendipitous. A pivotal moment occurred during a family holiday in Denpasar when his mother handed him a copy of Basement Jaxx’s 2001 album Rooty, igniting a passion for dance music that would shape his future. Relocating to Melbourne, Dom immersed himself in the city’s dynamic music culture. By day, he honed his skills as a graphic designer; by night, he transformed into a DJ, spinning records at local pubs and parties. This dual life continued until 2015 when, encouraged by the burgeoning success of his music, he made the bold decision to pursue his artistic endeavors full-time. Dom’s discography is a testament to his innovative approach to house music. Tracks like “Take It” (2018) and “San Frandisco” (2019) have not only dominated dance floors but also garnered critical acclaim, showcasing his knack for blending catchy hooks with deep, pulsating rhythms. His dynamic presence isn’t confined to the studio. Dom’s live performances are renowned for their energy and engagement, captivating audiences at festivals and clubs worldwide. His ability to connect with listeners, coupled with his relentless pursuit of sonic innovation, has solidified his status as a leading figure in the global house music scene. As Dom Dolla continues to evolve as an artist, his journey reflects a blend of serendipity, passion, and unwavering dedication to his craft. With each release and performance, he reaffirms his commitment to pushing the boundaries of dance music, inviting audiences to join him on an exhilarating auditory adventure.",
        "Genres": "EDM, DJ, Tech House, Bass House",
        "Scheduled": "Thursday",
        "Stage": "The Other",
        "StartTime": "11:00 PM",
        "EndTime": "1:00 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "28",
        "Artist": "Dope Lemon",
        "Description": "Dope Lemon, the captivating project from Australian singer-songwriter and multi-instrumentalist Angus Stone, has steadily carved a space for itself in the world of modern indie rock. Emerging from Stone’s solo work and collaborations, Dope Lemon blends laid-back, psychedelic vibes with rich layers of indie soul. The project’s debut album, Honey Bones (2016), was a statement of sorts—a shimmering, mellow landscape of distorted guitar, dreamlike vocals, and jazzy undertones. Its follow-up, Hounds Tooth (2017), saw Stone fine-tuning his craft, exploring a wider range of sonic textures while maintaining the project’s signature warmth. In 2019, Smooth Big Cat brought forth a more refined, cosmic sound—creating a soundscape perfect for both sunrise reflections and sunset drives. In early 2022, Dope Lemon released Rose Pink Cadillac, an album that further solidified the project’s identity. With tracks like “Rose Pink Cadillac” and “Honey,” the album balances both laid-back grooves and entrancing melodies. It’s a body of work that’s as easy to get lost in as it is to pick apart for its subtle intricacies. From the gentle sway of Honey Bones to the rich textures in Rose Pink Cadillac, Dope Lemon proves itself as an evolving yet consistent musical experience. Angus Stone’s ability to blend deep storytelling with hypnotic soundscapes makes this project a key player in today’s indie and alternative music scene. For fans of introspective indie rock with a cosmic twist, Dope Lemon is a band that continues to deliver, solidifying their presence in the hearts and minds of listeners worldwide.",
        "Genres": "Indie Pop, Psych Rock",
        "Scheduled": "Saturday",
        "Stage": "This Tent",
        "StartTime": "5:00 PM",
        "EndTime": "6:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "29",
        "Artist": "Eater",
        "Description": "DJ Eater (also known as EaterMusic) has been making a mark in the electronic music scene, blending deep, hypnotic basslines with electrifying rhythms that captivate audiences around the globe. Hailing from Italy, Eater began his journey into music production back in 2016. Over the years, he’s honed his craft and cultivated a unique sound that echoes through his tracks. His early releases, like the hauntingly deep “Meanwhile” in 2017, displayed his talent for pushing the boundaries of the genre. By 2018, Eater had already garnered attention within the industry, with his first EP “Sound” being a breakthrough moment that solidified his spot among the rising stars of the electronic music scene. His signature sound is one that fuses forward-thinking melodies with the kind of groove that gets under your skin, urging listeners to feel every beat. But it’s not just his recorded music that has set him apart—it’s his performances. With his appearances at top-tier festivals and clubs, including Lost Lands and Bass Canyon, Eater has proven his ability to command the stage. Fans flock to hear his immersive sets that seamlessly blend deep house and bass-driven beats, leaving audiences with an experience that lingers long after the final track fades. As Eater continues to evolve, so does his sound, pushing the envelope with each release. From his melodic build-ups to his drop-heavy climaxes, there’s an intensity and a fire in his work that is hard to ignore. He’s not just an artist; he’s a force to be reckoned with, and with a growing fanbase and constant momentum, it’s clear that his name is one to watch in the electronic music world.",
        "Genres": "DJ, EDM, Bass, Dubstep",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "5:15 PM",
        "EndTime": "6:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "30",
        "Artist": "Effin",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "4:00 PM",
        "EndTime": "5:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "31",
        "Artist": "Flatland Cavalry",
        "Description": "Flatland Cavalry, a Texas-based Americana band, has been a cornerstone of the state’s country music scene since their formation in 2014. Originating from Lubbock, Texas, the group was founded by Cleto Cordero, who serves as the lead vocalist and primary songwriter. The ensemble’s lineup also includes guitarist Reid Dillon, bassist Jonathan Saenz, drummer Jason Albers, and fiddler Laura Jane. Their debut album, Come May, Come Fall, released in 2015, showcased their blend of traditional country and folk influences. This was followed by Homeland Insecurity in 2018, which further solidified their reputation for heartfelt storytelling and authentic sound. In 2023, Flatland Cavalry released Wandering Star, an album that reflects their growth and continued commitment to the Americana genre. Flatland Cavalry remains a vital part of the Americana music landscape, known for their engaging live performances and dedication to their craft.",
        "Genres": "Americana, Country, Folk",
        "Scheduled": "Saturday",
        "Stage": "Which Stage",
        "StartTime": "3:45 PM",
        "EndTime": "4:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "32",
        "Artist": "Flipturn",
        "Description": "Flipturn, the indie rock band born in the coastal town of Fernandina Beach, Florida, is a band that knows no boundaries. What started as a group of high school friends jamming in a garage soon turned into an undeniable force on the alternative scene. Founded in 2015 by Dillon Basse (vocals), Tristan Duncan (guitar), and Madeline Jarman (bass), the trio spent their early years honing a sound that blended elements of classic rock, atmospheric indie, and raw emotion. They quickly became known for their live shows, each performance packed with energy and a sense of urgency that matched their high school days spent on stage. After attending college at the University of Florida, Flipturn expanded their lineup, adding guitarist and synthesizer player Mitch Fountain and drummer Devon VonBalson. This shift brought a new dimension to the band’s sound, with the lush textures of synths weaving seamlessly into their driving guitars and punchy rhythms. The result was their debut album, Shadowglow, released in August 2022. The album encapsulates the band’s evolution and the sound they’ve cultivated—emotionally charged lyrics paired with expansive, anthemic indie rock. Shadowglow resonated with listeners, marking Flipturn as a band with both staying power and wide-reaching appeal. Their growing presence didn’t go unnoticed, and soon, Flipturn found themselves sharing stages at massive festivals like Lollapalooza, Governor’s Ball, Bonnaroo, and SXSW. They’ve earned a reputation as a band that brings something fresh to the table—a palpable energy, a mix of personal reflection and escapism, and a willingness to explore new musical territory. The anticipation for their sophomore album, Burnout Days, set for release in January 2025, shows how far they’ve come and where they’re headed next. The band’s growth is reflected not only in their music but in their loyal fanbase, which has been steadily increasing since the release of Shadowglow. Flipturn isn’t just a band; they’re a journey—one that is about to take listeners even further with Burnout Days. With their unique blend of infectious hooks, introspective lyrics, and diverse sound, Flipturn is poised to break out of the indie rock world and into something even greater.",
        "Genres": "Indie Rock, Alternative, Indie Pop",
        "Scheduled": "Friday",
        "Stage": "What Stage",
        "StartTime": "4:45 PM",
        "EndTime": "5:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "33",
        "Artist": "Foster the People",
        "Description": "Foster the People emerged from the indie pop scene in 2009, crafted by the sharp and distinctive vision of frontman Mark Foster. Originally conceived as a solo project, the band quickly evolved into a full-fledged ensemble, with Mark joined by Cubbie Fink (bass) and Mark Pontius (drums). The group’s breakthrough arrived in 2010 with “Pumped Up Kicks,” an infectious tune with a deceptively dark undercurrent. Its success was immediate, catapulting them into the limelight and leading to a record deal with Startime International. Their debut album, Torches (2011), solidified their place in pop culture. With tracks like “Helena Beat” and “Houdini,” the album blended upbeat, catchy melodies with introspective lyrics, setting them apart from the typical radio-friendly fare. It wasn’t just the infectious hooks that earned Foster the People their fanbase—it was the emotional weight woven into their anthems. In 2014, the band returned with Supermodel, an album that saw them branching out sonically while still maintaining their signature infectious vibe. They dove deeper into experimental territory, delivering a collection that was rich in texture and layered with influences ranging from ’80s pop to darker, more introspective themes. The bold move paid off as the album earned praise for its adventurous spirit. By 2017, they offered Sacred Hearts Club, an album that delved into even more eclectic sounds. With hits like “Sit Next to Me” and “Loyal Like Sid & Nancy,” the band continued their evolution, pushing past the easy-to-label confines of their earlier work. The record resonated with listeners through its combination of dreamy pop landscapes and emotional undercurrents, a signature Foster the People blend. After a few years of relative quiet, the band came back in 2024 with Paradise State of Mind, their fourth studio album. The record brings together the best of their past while exploring new territories, expanding their sound and lyrical depth. Foster the People has always had an ear for the current moment, and with Paradise State of Mind, they prove their staying power, adapting to both their growth as artists and the changing landscape of pop music. Foster the People continues to evolve, adding new dimensions to their sound while staying true to the core emotional threads that have always defined their music: the search for meaning in a world that’s constantly shifting. Whether they’re singing about the struggles of growing up or capturing the emotional chaos of modern life, Foster the People always brings something fresh to the table. Their journey is one of continuous reinvention, and there’s no sign of slowing down.",
        "Genres": "Indie Pop, Electro Pop",
        "Scheduled": "Friday",
        "Stage": "What Stage",
        "StartTime": "6:45 PM",
        "EndTime": "7:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "34",
        "Artist": "Gigi Perez",
        "Description": "Gigi Perez is a rising star in the alternative music scene, blending a unique combination of lo-fi, indie, and folk influences to create deeply emotional and engaging tracks. Born on February 4, 2000, in Hackensack, New Jersey, and raised in West Palm Beach, Florida, Gigi’s music journey began in her teens. Self-taught in guitar, piano, and ukulele, she started writing her own songs and shaping her signature sound long before stepping into the spotlight. Her musical talent blossomed during her high school years when she formed the fuzz-folk band Wendy Lane, alongside her friends—including Aidan Hobbs, a producer and multi-instrumentalist who would later become one of her key collaborators. After a brief stint at Berklee College of Music, Gigi made the bold move to New York City, where she focused on crafting her solo material. In 2021, Gigi’s music took flight when she shared a snippet of “Sometimes (Backwood)” on social media. The track quickly went viral, earning over 18 million streams in its first month and climbing to the top of Spotify’s U.S. Viral Chart. By now, the song has surpassed 200 million streams worldwide, cementing her as a breakout talent in the alternative genre. Her debut EP, How To Catch A Falling Knife, arrived soon after, showcasing the raw emotion and authenticity that made her viral hit so powerful. The EP encapsulates themes of love, heartbreak, and self-discovery, further reflecting her ability to connect with listeners through her heartfelt storytelling. Tracks from the EP combine melancholy melodies with vibrant instrumentation, establishing Gigi as a promising new voice in the alternative music landscape. Her ever-growing fanbase and critical acclaim suggest that Gigi Perez is only just getting started, and with each release, she continues to make waves in the indie music scene. As her sound evolves, there’s no doubt that Gigi’s distinct voice and raw, emotive energy will keep resonating with listeners far and wide.",
        "Genres": "Singer-Songwriter, Indie Folk, Lo-Fi, Bedroom Pop",
        "Scheduled": "Saturday",
        "Stage": "What Stage",
        "StartTime": "3:00 PM",
        "EndTime": "3:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "35",
        "Artist": "Ginger Root",
        "Description": "Ginger Root, the musical alias of Cameron Lew, is a Southern California-based artist who’s been redefining what it means to blend genres, blending indie pop, soul, and funk into an eclectic and captivating mix. His music channels a style that can best be described as “Aggressive Elevator Soul,” fusing elements of the retro charm of Japanese City Pop with modern indie sensibilities. Lew’s unique sound finds inspiration in the likes of Toro y Moi, Vulfpeck, Metronomy, and Kero Kero Bonito, while also nodding to classic soul eras and the musicality of Japan’s ‘80s era. Though by day Lew serves as a film and multimedia editor, he’s spent the past several years building a name for himself as a musician, first launching Ginger Root in 2017. Since then, his eclectic mix of sounds and genres has attracted listeners who crave something fresh, unpredictable, and undeniably smooth. As with many genre-defying acts, Ginger Root is an invitation into a world where smooth grooves meet experimental flourishes—an ever-evolving journey that’s garnered him a steadily growing fanbase and a reputation for being one of the most exciting new artists out of the indie scene. While his breakout tracks like “Loretta” and “City Slicker” have put him in the spotlight, Ginger Root’s music continues to show growth, each new release offering a unique look into his musical vision. For Lew, it’s all about creating soundtracks that embody the feeling of elevating everyday life, keeping listeners hooked with his upbeat, catchy rhythms and infectious energy. Fans of Ginger Root can catch him performing live across various venues or stream his work on platforms like SoundCloud, while his official website serves as the ultimate hub for all things related to the artist.",
        "Genres": "Indie Rock, Psych Rock, Funk",
        "Scheduled": "Friday",
        "Stage": "That Tent",
        "StartTime": "1:30 PM",
        "EndTime": "2:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "36",
        "Artist": "Glass Animals",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Which Stage",
        "StartTime": "12:30 AM",
        "EndTime": "1:45 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "37",
        "Artist": "Glorilla",
        "Description": "GloRilla, born Gloria Woods on July 28, 1999, in Memphis, Tennessee, has swiftly ascended the ranks of hip-hop, carving out a distinctive niche with her raw lyricism and commanding presence. Emerging from Memphis—a city renowned for its rich musical heritage—GloRilla’s early exposure to the genre laid the foundation for her dynamic career. In April 2022, GloRilla released “F.N.F. (Let’s Go),” a collaboration with producer Hitkidd. The track resonated deeply with audiences, propelling her into the spotlight and earning critical acclaim. This success was further solidified with the release of her second EP, Anyways, Life’s Great, on November 11, 2022. The EP showcased her versatility and solidified her position in the hip-hop scene. GloRilla’s debut studio album, Glorious, released on October 11, 2024, marked a significant milestone in her career. The album features collaborations with artists such as Latto, Megan Thee Stallion, and T-Pain, reflecting her growing influence and versatility within the industry. GloRilla continues to captivate audiences with her authentic storytelling and dynamic performances, solidifying her status as a rising star in the hip-hop community.",
        "Genres": "Rap, Hip-Hop",
        "Scheduled": "Sunday",
        "Stage": "This Tent",
        "StartTime": "7:45 PM",
        "EndTime": "8:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "38",
        "Artist": "Goldie Boutilier",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "This Tent",
        "StartTime": "1:15 PM",
        "EndTime": "2:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "39",
        "Artist": "Goose",
        "Description": "Goose is a band that thrives in the moment, channeling energy, improvisation, and a deep sense of musical adventure into every note. Formed in 2014 in Connecticut, this five-piece collective—Rick Mitarotonda (guitar/vocals), Peter Anspach (guitar/keys/vocals), Cotter Ellis (drums), Trevor Weekz (bass), and Jeff Arevalo (percussion)—quickly found their place within the modern jam band scene. Their ability to blend rock, funk, soul, and a generous dose of improvisation has earned them a dedicated following that continues to grow with each performance. Goose’s music is a journey, one where fluidity is key and the boundaries of genre dissolve in real-time. Whether it’s a sweeping guitar solo that transitions into a deep funk groove, or an intricate vocal harmony giving way to expansive improvisation, their live performances are nothing short of electric. It’s this sense of spontaneity and connection that makes Goose so special, with every show offering a unique experience that keeps fans coming back for more. In 2022, they dropped Dripfield, their third studio album, which cemented their status as one of the most exciting acts in the jam band world. The album blends the sonic textures of rock and funk, peppered with moments of soul and jazz, all while maintaining the signature Goose approach of dynamic improvisation. Songs like “Madhuvan” and “Hungersite” demonstrate the band’s deep understanding of groove, mood, and musical conversation, while also showcasing their growth as artists. It’s a record that feels as timeless as it does progressive, capturing their energy in a polished but still raw form. Goose isn’t just a band; they are a musical force that plays with time, space, and sound in ways that few others do. Every show is an invitation to witness something unique, and the band has solidified its place as a leader in the ever-evolving jam band scene.",
        "Genres": "Jam Band, Funk, Indie Rock, Alternative",
        "Scheduled": "Friday",
        "Stage": "Which Stage",
        "StartTime": "9:30 PM",
        "EndTime": "11:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "40",
        "Artist": "Gorgon City",
        "Description": "Gorgon City, the dynamic electronic duo from North London, has been a driving force in the dance music scene since their formation in 2012. Comprising Kye “Foamo” Gibbon and Matt “RackNRuin” Robson-Scott, the pair have seamlessly blended elements of house, garage, and pop to create a sound that’s both innovative and accessible. Their breakthrough came with the 2014 singles “Ready for Your Love” and “Here for You,” both of which soared into the UK Top 10, solidifying their status as rising stars in the electronic music landscape. In 2023, Gorgon City announced their fourth studio album, Salvation, and released the single “Lost & Found,” further showcasing their evolution and commitment to pushing musical boundaries. Gorgon City continues to captivate audiences worldwide with their electrifying performances and genre-defying tracks, reaffirming their place at the forefront of contemporary dance music.",
        "Genres": "EDM, DJ, Deep House, Garage",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "2:15 AM",
        "EndTime": "5:15 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "41",
        "Artist": "GorillaT",
        "Description": "GorillaT is a rising DJ and electronic music producer who’s taking the EDM scene by storm with his electrifying blend of dubstep and high-energy soundscapes. Hailing from Golden, Colorado, Gorillat’s path to becoming a notable figure in the world of EDM was sparked by a transformative experience at a Subtronics concert. Inspired by the electrifying energy of the live show, he decided to dive into music production, setting the stage for his rapidly growing career. Gorillat’s dedication and keen sense of innovation have led him to quickly establish a unique sound in the genre, drawing influence from heavy hitters like Subtronics, Virtual Riot, and BoogieT. Known for his ability to infuse gritty basslines with intense drops and intricate beats, Gorillat’s music strikes a balance between headbanging dubstep and immersive electronic elements. His style has quickly made an impact, earning him recognition within the dubstep community and a loyal following of fans eager for his next release. His relentless drive has seen him perform at prestigious events, including Excision’s The Thunderdome, where his infectious energy and skill behind the decks set him apart as one of the scene’s brightest up-and-coming talents. With a growing presence in the EDM world, GorillaT is making a name for himself through his unwavering commitment to creating music that pushes boundaries and connects with listeners on a visceral level. His work ethic, creativity, and the ability to craft bass-driven masterpieces have secured him collaborations with notable artists, positioning him as one of the most promising figures in modern dubstep.",
        "Genres": "EDM, DJ, Experimental, Bass, Dubstep",
        "Scheduled": "Sunday",
        "Stage": "The Other",
        "StartTime": "3:00 PM",
        "EndTime": "4:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "42",
        "Artist": "Grace Bowers",
        "Description": "Grace Bowers, an 18-year-old powerhouse guitarist, songwriter, and bandleader, is redefining the landscape of contemporary blues, rock, and funk with her infectious debut album, Wine On Venus. Born with a deep love for music, Grace began her career by performing in dive bars, immersing herself in the sounds of legendary blues artists like B.B. King, while also exploring the raw energy of funk icons such as Sly and the Family Stone. Her multifaceted approach to music is evident in the vibrant, genre-blending tracks that populate her debut album. Produced by John Osborne of Brothers Osborne, Wine On Venus quickly earned acclaim, with outlets like Forbes describing the album as “an infectious, joyous party.” Rolling Stone heralded Grace as “Nashville’s new guitar hero,” propelling her into the spotlight with the intensity and passion that sets her apart in the modern music scene. Grace’s journey to success was ignited during the pandemic when viral videos of her guitar solos made waves, leading to rapid recognition from both fans and industry veterans. In addition to her impressive musical career, Grace has been recognized as a rising star, receiving the Variety Next Gen award and appearing on high-profile shows like Jimmy Kimmel Live! and CBS Mornings. Her journey has also seen her tour with major artists such as The Red Clay Strays, Gary Clark Jr., The Allman Betts Family Revival, and The Roots. Grace’s breakthrough moment arrived when she made her Grand Ole Opry debut on her 18th birthday, solidifying her place as a leader of the new wave of female musicians breaking into the music industry. What makes Grace Bowers especially unique is her combination of raw talent, unwavering passion, and a musical style that bridges generations. As a U.S. Global Music Ambassador, recognized by the U.S. Department of State and YouTube’s Global Music Diplomacy Initiative, Grace has become a beacon of inspiration to young musicians across the globe. With a voice as bold and dynamic as her guitar riffs, she is poised to leave an indelible mark on the music world.",
        "Genres": "Acoustic, Indie Rock, Funk",
        "Scheduled": "Sunday",
        "Stage": "That Tent",
        "StartTime": "1:30 PM",
        "EndTime": "2:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "43",
        "Artist": "Green Velvet",
        "Description": "Green Velvet, born Curtis Alan Jones on April 26, 1968, in Chicago, Illinois, is one of the true pioneers of house and techno music. His journey from the Windy City’s deep roots in blues, jazz, and funk to becoming an electronic music icon is as unconventional as the genre he helped shape. But it wasn’t always music that called to him—Jones first explored other creative paths before discovering his true calling in the electronic scene. By the late 1980s, it was Chicago’s house music radio broadcasts that sparked his shift. Armed with a basic keyboard, a drum machine, and a four-track recorder, he created his first tracks, laying the foundation for what would become a career that blended pure innovation with raw energy. In the early ’90s, he returned to Chicago after a stint at the University of California, Berkeley, diving headfirst into the city’s blossoming house scene. His Cajmere alias emerged alongside Cajual Records, the label that would define Chicago house music, and in 1992, the iconic track “Percolator” became his stamp on the world. The groove-heavy, infectious track became an anthem of the underground, putting Jones firmly on the map. But it wasn’t until the late ’90s that he transformed into the Green Velvet persona—distinctive green mohawk, eccentric stage presence, and a darker, experimental edge that pushed boundaries. Tracks like “La La Land” and “Flash” came to define this alter ego, a departure from the traditional house and into something a little more complex, a little more provocative. Green Velvet became synonymous with tracks that weren’t just about the beats—they were about the vibe, the experience. His sound was as electrifying as his live performances, fusing house, techno, and acid house into a potent, genre-defying mix. Today, Green Velvet’s legacy is undeniable. His tracks continue to be revered by fans and artists alike, and his energetic performances still have the power to ignite any dance floor. A true innovator, Green Velvet has shaped and reshaped the electronic music landscape, all while maintaining a commitment to the darker side of the groove. Whether under the Cajmere name or with his Green Velvet alter ego, Jones remains a force, forever pushing forward with the same bold vision that made him a legend.",
        "Genres": "EDM, DJ, Techno, House",
        "Scheduled": "Thursday",
        "Stage": "The Other",
        "StartTime": "7:45 PM",
        "EndTime": "8:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "44",
        "Artist": "Hey, Nothing",
        "Description": "Hey, Nothing, an indie-folk duo from the suburbs of Atlanta, Georgia, is carving out their place in the indie music scene with a sound that blends raw emotion and infectious melodies. The duo, consisting of Tyler Mabry and Harlow Phillips, began recording together in high school and have been honing their craft ever since. Their music is a blend of folk-rock sensibilities, with the sincerity of modern emo and the spirit of folk-punk, creating a vibe that feels both personal and expansive. Their 2023 debut album, We’re Starting to Look Like Each Other, is a testament to their ability to craft songs that are simultaneously intimate and anthemic. With their evocative lyrics and rich harmonies, the album is a candid exploration of personal growth, heartache, and the moments that shape us. It’s no wonder the duo’s sound has been compared to a mix of Modern Baseball and Violent Femmes, delivering a raw, energetic take on indie-folk that leaves an impression long after the last note fades. In 2024, Hey, Nothing released their EP Maine, further solidifying their place in the indie-folk scene. The EP continues to showcase their growth as musicians, weaving their trademark vulnerability with an increasingly sophisticated approach to songwriting and production. Songs like “Maine” capture the wandering spirit of their music, the quiet moments, and the quietest battles that echo through their lyrics. They’ve already shared their work with fans across the country, drawing comparisons to acts like Modern Lovers and Anthony Green, all while keeping their distinct sound firmly in place. There’s something refreshingly familiar about Hey, Nothing’s music—its honesty, its approachability, and its deep sense of yearning. Whether playing in intimate settings or larger venues, Hey, Nothing has proved they’re not just an act to watch—they’re a force in the making. Their music isn’t about grandiose statements, but about the quiet resilience of those who remain in the pursuit of connection. With every release, they only get better, and the world is starting to take notice.",
        "Genres": "Indie Rock, Shoegaze, Indie Americana",
        "Scheduled": "Thursday",
        "Stage": "That Tent",
        "StartTime": "6:15 PM",
        "EndTime": "7:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "45",
        "Artist": "Hot Mulligan",
        "Description": "Hot Mulligan, the emo quartet from Lansing, Michigan, has been a cornerstone of the American emo scene since their formation in 2014. Comprising vocalist Tades Sanville, guitarist Chris Freeman, guitarist Ryan Malicsi, and drummer Brandon Blakeley, the band has evolved from basement shows to national acclaim. Their 2015 EPs, Fenton and Honest & Cunning, released via Michigan-based label Save Your Generation Records, marked their entry into the music scene. In 2017, after signing with No Sleep Records, they re-released the EP Opportunities and followed up with their debut full-length album, Pilot, in 2018. In 2020, Hot Mulligan released their second album, You’ll Be Fine, further solidifying their presence in the emo genre. Their 2023 album, Why Would I Watch, continues their tradition of blending raw emotion with melodic instrumentation. Hot Mulligan remains a vital force in the emo music landscape, known for their engaging live performances and dedication to their craft.",
        "Genres": "Emo, Pop Punk",
        "Scheduled": "Saturday",
        "Stage": "That Tent",
        "StartTime": "4:15 PM",
        "EndTime": "5:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "46",
        "Artist": "Hozier",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "What Stage",
        "StartTime": "9:30 PM",
        "EndTime": "11:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "47",
        "Artist": "Insane Clown Posse",
        "Description": "Insane Clown Posse (ICP) isn’t just a hip-hop duo; they’re a cultural phenomenon, a movement forged in the gritty streets of Detroit. Formed in 1989 by childhood friends Joseph Bruce (Violent J) and Joseph Utsler (Shaggy 2 Dope), ICP has spent decades carving out their own lane, fueled by a wild mix of horror-inspired lyrics, theatrical personas, and a loyal fanbase like no other. At the heart of ICP is their commitment to storytelling. Their music is a visceral trip into the dark corners of the imagination, blending horrorcore rap with elements of funk, R&B, and even rock. From their debut album Carnival of Carnage to the sprawling mythology of their “Dark Carnival” saga, ICP’s discography is a wild ride through twisted themes of redemption, morality, and chaos. It’s heavy, it’s weird, and it’s uniquely them. But ICP isn’t just about the music—it’s about the family. Over the years, they’ve cultivated a fiercely devoted fanbase known as Juggalos. This isn’t your typical fan club. Juggalos are a community, bonded by a shared love of ICP’s no-holds-barred approach to music and life. That bond is celebrated annually at the Gathering of the Juggalos, a festival that’s as much about music as it is about the unapologetic embrace of individuality and belonging. ICP’s journey hasn’t been without controversy. Critics and skeptics have long tried to write them off, but Bruce and Utsler have always thrived on proving doubters wrong. Their resilience and relentless DIY spirit have taken them from underground Detroit venues to gold and platinum records, cementing their place as pioneers of the horrorcore genre. Insane Clown Posse isn’t just a duo—it’s a world unto itself, a kaleidoscopic explosion of sound, spectacle, and subculture. Whether you get it or not, one thing’s certain: ICP isn’t going anywhere, and they’re taking their Juggalos along for the ride.",
        "Genres": "Horrorcore, Rap",
        "Scheduled": "Thursday",
        "Stage": "This Tent",
        "StartTime": "12:30 AM",
        "EndTime": "1:30 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "48",
        "Artist": "Inzo",
        "Description": "INZO, born Mike Inzano on December 3, 1992, in Chicago, has firmly established himself as one of the most captivating and genre-blurring electronic music producers of the moment. His early connection to music was anything but conventional. Beginning with piano lessons at just four years old, he explored classical pieces, soon expanding his horizons by picking up the drums at six. It was the Red Hot Chili Peppers’ infectious rhythms that ignited his passion for percussion, leading him to dive headfirst into a range of musical styles from a young age. However, it wasn’t until his high school years that his creativity truly began to soar. Playing in a metal band seemed to be the natural path, but after a missed opportunity to perform at Warped Tour, he shifted focus. Though Inzano originally set his sights on a medical career, the siren call of music would not be ignored. During his freshman year of college, he abandoned his pre-med studies and turned to music production, a decision that set the stage for everything to follow. INZO’s sound, a signature blend of euphoric melodies, atmospheric synths, and intricate basslines, paints vivid sonic landscapes that have caught the attention of fans and industry professionals alike. Drawing from future bass, dubstep, and experimental electronica, his music radiates a unique energy that strikes a balance between introspection and boundless energy. Tracks like “Overthinker” (2018) captured listeners’ imaginations and racked up millions of streams, launching INZO into the spotlight. His 2019 debut EP, Multiverse, further solidified his ability to stretch the boundaries of genre, with standout tracks like “Let It Slide” and “Y” showing off his versatility. But it was in 2023 with Earth Magic that INZO truly blossomed, his music sounding more refined and expansive than ever before. As he continues to expand his catalog and grow his audience, INZO remains committed to pushing the envelope of what electronic music can be, channeling a distinct sense of vision and purpose into every note. With an ever-growing fanbase, the future looks incredibly bright for the visionary artist from Chicago.",
        "Genres": "DJ, EDM, Future Bass, Downtempo, Electro Bounce",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "9:00 PM",
        "EndTime": "10:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "49",
        "Artist": "Jack's Mannequin",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "That Tent",
        "StartTime": "6:15 PM",
        "EndTime": "7:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "50",
        "Artist": "Jade Cicada",
        "Description": "Jade Cicada, the moniker of Skyler Golden, is an electronic music producer and DJ known for his ability to weave intricate soundscapes that seamlessly merge elements of glitch, dubstep, and experimental bass music. Hailing from Lenox, Massachusetts, Jade Cicada’s journey into music started in his childhood, influenced by a strong classical background. His foundation in traditional music theory led him to explore new territories, ultimately finding his voice in electronic production. Golden’s academic pursuits took him to the Berklee College of Music, where he further honed his craft, studying Electronic Production & Design and delving into the complexities of Jazz theory. This blend of classical rigor and electronic innovation quickly set him apart in the electronic music scene. Since debuting in 2015, Jade Cicada has earned a reputation for his captivating performances, which draw on his years of experience and musical education. He’s played at major festivals across the United States, where his seamless fusion of minimalism and maximalism has won over diverse audiences. His music, which often channels the gritty sounds of artists like J Dilla and DJ Premier, exudes both complexity and accessibility, striking a perfect balance between experimental and familiar. 2018 marked a pivotal year for the artist with the release of his Fish Juice EP, a project that solidified his place within the evolving landscape of electronic music. Known for his innovative approach and magnetic live shows, Jade Cicada continues to carve out his space in the genre. His work is a reflection of his dedication to both pushing boundaries and creating immersive, emotive experiences for listeners.",
        "Genres": "EDM, DJ, Glitch Hop, Experimental Bass, Dubstep",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "8:45 PM",
        "EndTime": "9:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "51",
        "Artist": "James Arthur",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "What Stage",
        "StartTime": "2:00 PM",
        "EndTime": "2:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "52",
        "Artist": "Jessie Murph",
        "Description": "Jessie Murph, born on September 22, 2004, in Clarksville, Tennessee, is an American singer and songwriter whose emotive storytelling and genre-blending sound have captivated audiences worldwide. Raised in Huntsville, Alabama, she was immersed in music from an early age, drawing inspiration from artists like Adele, Amy Winehouse, and Drake. Murph’s musical journey began on social media platforms, where she shared vlogs and covers, quickly amassing a dedicated following. Her authentic voice and relatable lyrics resonated with listeners, leading to her discovery and subsequent signing with Columbia Records in 2021. In 2023, Murph released her debut album, That Ain’t No Man That’s the Devil, featuring collaborations with artists like Maren Morris and Jelly Roll. The album delves into themes of personal experiences and emotions, showcasing her versatility and depth as an artist. Jessie Murph continues to evolve her sound, blending elements of country, pop, and blues, and remains a rising star in the music industry.",
        "Genres": "Alternative Pop",
        "Scheduled": "Saturday",
        "Stage": "Which Stage",
        "StartTime": "5:30 PM",
        "EndTime": "6:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "53",
        "Artist": "Joey Valence & Brae",
        "Description": "Joey Valence & Brae are not your typical hip-hop duo. Emerging from State College, Pennsylvania, the pair has built a sound that’s as unpredictable as it is exhilarating. Comprising Joseph Bertolino (Joey Valence) and Braedan Lugue (Brae), their story begins not in a studio, but in a dorm room at Pennsylvania State University. It was there that they began blending elements of alternative hip-hop, rap rock, and nerdcore, creating a sound that was part ‘90s nostalgia, part forward-thinking innovation. Their breakout moment came in 2022 with the release of “Punk Tactics.” The track quickly gained viral attention, not just for its catchy flow and gritty beats, but for its unique visual accompaniment: a music video shot entirely on a Nintendo DSi. This kind of creative ingenuity quickly became the hallmark of their brand—music that wasn’t just about the sound but about an experience, blending the worlds of video games, rap, and an era-defining culture. Fast forward to 2024, and Joey Valence & Brae are ready to level up again. With their sophomore album No Hands, they not only stormed the U.S. charts, but also solidified their place in the music scene. Featuring high-profile collaborations with artists like Z-Trip, Terror Reid, and Danny Brown, No Hands combines hard-hitting rap with glitchy, genre-defying beats, creating a sound that thrives in the intersection of classic hip-hop and modern sensibilities. Singles like “The Baddest” and “Omnitrix” took over platforms like Instagram Reels and TikTok, cementing their growing fanbase. Their high-energy performances are just as compelling as their music. Whether they’re headlining festivals like Aftershock or joining forces with The Interrupters on Sum 41’s final tour, Joey Valence & Brae’s live shows are a frenzy of beats, bars, and crowd interaction that leave audiences buzzing. They’ve made it clear: they’re here to stay, reshaping hip-hop’s landscape with every beat drop and rhyme. This is the new era of rap: bold, inventive, and ready to take over. Joey Valence & Brae aren’t just riding the wave—they’re creating it.",
        "Genres": "Alternative Hip Hop",
        "Scheduled": "Thursday",
        "Stage": "That Tent",
        "StartTime": "12:15 AM",
        "EndTime": "1:15 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "54",
        "Artist": "John Summit",
        "Description": "John Summit’s rise from humble beginnings to become one of the most exciting names in modern house music feels like a victory lap for anyone who’s ever hustled behind the scenes. Born in Chicago, Illinois, Summit (real name John Schuster) grew up with a keen ear for electronic sounds. What set him apart, though, was his determination to chase the feeling of a life lived in rhythm and melody. Before the beats took over, he worked as an accountant, but it was always the music that called. When he finally made the leap, there was no looking back. Summit’s breakthrough came in 2020 with the release of “Deep End.” A bouncy, melodic tech-house anthem, it signaled the arrival of an artist who wasn’t afraid to mix groove with grit. The track made waves, catching the ears of big-name labels and artists alike. It was the beginning of a string of hits that would cement his place in the scene. His debut album, Comfort in Chaos (2023), is where Summit really lets his creativity run free. With a mix of introspective tracks and high-energy anthems, it’s a reflection of the artist’s growth and versatility. Each track feels like a journey—there’s the deep, soulful vibe that’s perfect for losing yourself in the music, and then there’s the pounding basslines that make you want to move your body all night long. But it’s not just about studio work for Summit. His live shows have earned him a reputation as a force to be reckoned with. From headlining major festivals to a residency in Las Vegas, Summit has built a loyal following with his electric performances. It’s in these moments that his connection with the crowd is most palpable. The way he plays with energy, feeding off the audience and bringing them with him on every drop, is what sets him apart as one of the true modern stars of house music. John Summit’s journey is far from over. With his infectious beats, anthemic tracks, and undeniable charisma, he’s one of the most exciting forces in the electronic world right now. And as he continues to push boundaries, there’s no telling how high his star will rise.",
        "Genres": "EDM, DJ, Tech House",
        "Scheduled": "Friday",
        "Stage": "What Stage",
        "StartTime": "8:45 PM",
        "EndTime": "10:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "55",
        "Artist": "John Summit",
        "Description": "John Summit’s rise from humble beginnings to become one of the most exciting names in modern house music feels like a victory lap for anyone who’s ever hustled behind the scenes. Born in Chicago, Illinois, Summit (real name John Schuster) grew up with a keen ear for electronic sounds. What set him apart, though, was his determination to chase the feeling of a life lived in rhythm and melody. Before the beats took over, he worked as an accountant, but it was always the music that called. When he finally made the leap, there was no looking back. Summit’s breakthrough came in 2020 with the release of “Deep End.” A bouncy, melodic tech-house anthem, it signaled the arrival of an artist who wasn’t afraid to mix groove with grit. The track made waves, catching the ears of big-name labels and artists alike. It was the beginning of a string of hits that would cement his place in the scene. His debut album, Comfort in Chaos (2023), is where Summit really lets his creativity run free. With a mix of introspective tracks and high-energy anthems, it’s a reflection of the artist’s growth and versatility. Each track feels like a journey—there’s the deep, soulful vibe that’s perfect for losing yourself in the music, and then there’s the pounding basslines that make you want to move your body all night long. But it’s not just about studio work for Summit. His live shows have earned him a reputation as a force to be reckoned with. From headlining major festivals to a residency in Las Vegas, Summit has built a loyal following with his electric performances. It’s in these moments that his connection with the crowd is most palpable. The way he plays with energy, feeding off the audience and bringing them with him on every drop, is what sets him apart as one of the true modern stars of house music. John Summit’s journey is far from over. With his infectious beats, anthemic tracks, and undeniable charisma, he’s one of the most exciting forces in the electronic world right now. And as he continues to push boundaries, there’s no telling how high his star will rise.",
        "Genres": "EDM, DJ, Tech House",
        "Scheduled": "Friday",
        "Stage": "Infinity Stage",
        "StartTime": "12:45 AM",
        "EndTime": "3:00 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "56",
        "Artist": "JPEGMAFIA",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "This Tent",
        "StartTime": "12:30 AM",
        "EndTime": "1:45 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "57",
        "Artist": "Justice",
        "Description": "EDM duo Justice, hailing from Paris, France, have long been at the forefront of genre-defying electronic music, blending a variety of influences into a sound that is unmistakably their own. Composed of Gaspard Augé and Xavier de Rosnay, Justice quickly made their mark on the global music scene with their unique approach to electronic production, incorporating elements of rock, electro, disco, and indie. Emerging in the early 2000s, their self-titled debut album, † (pronounced “Cross”), arrived in 2007 like a bolt of lightning, capturing the attention of music lovers and critics alike. Tracks like “D.A.N.C.E.” and “Genesis” became anthems, cementing their status as pioneers of French electronic music. Following the immense success of †, Justice didn’t rest on their laurels. They evolved with their 2011 album Audio, Video, Disco, which explored more rock-centric sounds, incorporating progressive rock influences alongside their signature electronic beats. It was a bold, experimental move, showing the duo’s ability to push boundaries, embracing everything from heavy guitar riffs to experimental soundscapes. Even while Audio, Video, Disco may have been more divisive in its sound, it further solidified Justice’s identity as artists not content with staying within the confines of a single genre. The duo took a step back before returning with their 2016 album Woman, marking their long-awaited comeback after years of silence. Continuing their exploration of the intersection between electronic music and other genres, Woman also saw collaborations with artists like Morgan Phalen and Roméo Elvis. The record earned praise for its cohesiveness and bold production, expanding their sound yet again while keeping the signature Justice flair intact. Known for their electrifying live performances, Justice has earned a reputation not just for their music but for their visual aesthetic. Their shows are more than just concerts—they are full-on experiences, featuring elaborate visuals often laden with religious and political imagery, taking audiences on an immersive journey. Their influence has extended beyond music into fashion and visual arts, becoming a key touchstone for the evolution of modern electronic music. As they continue to evolve, Justice remains a defining force in the electronic scene, constantly challenging and reshaping the boundaries of what is possible in both sound and spectacle.",
        "Genres": "EDM, DJ, French House, Electronic Bliss",
        "Scheduled": "Saturday",
        "Stage": "Which Stage",
        "StartTime": "12:15 AM",
        "EndTime": "1:30 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "58",
        "Artist": "King Gizzard & The Lizard Wizard",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "This Tent",
        "StartTime": "7:00 PM",
        "EndTime": "9:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "59",
        "Artist": "King Gizzard & The Lizard Wizard",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "This Tent",
        "StartTime": "12:15 AM",
        "EndTime": "2:15 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "60",
        "Artist": "King Gizzard & The Lizard Wizard",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "Which Stage",
        "StartTime": "6:15 PM",
        "EndTime": "7:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "61",
        "Artist": "Kitchen Dwellers",
        "Description": "Kitchen Dwellers, the Montana-based quartet, have been steadily growing their place in the bluegrass and Americana scene, all while pushing the boundaries of what we expect from those genres. Formed in Bozeman, Montana, the band—comprising Max Davies (guitar and vocals), Joe Funk (bass), Torrin Daniels (mandolin), and Sam Parks (banjo)—has crafted a distinctive sound that blends the roots of bluegrass with the free-spirited exploration of rock and psychedelia. Their music is far from confined to traditional bluegrass. While their instrumentation pays homage to the genre’s deep roots, the Kitchen Dwellers infuse their work with elements of jam-band improvisation and progressive rock, creating a sound that feels both timeless and forward-thinking. With a growing catalog of albums, including Ghost In The Bottle (2017), Muir Maid (2019), and Live from the Wilma (2021), their 2022 release, Wise River, marked a major moment in their evolution. The album earned critical acclaim for its seamless fusion of storytelling and musical experimentation, a testament to their ability to blend genres while staying true to their core. Kitchen Dwellers are no strangers to the stage, having performed at iconic venues like Red Rocks Amphitheatre and shared the stage at major festivals like Telluride Bluegrass and WinterWonderGrass. Their live shows are a dynamic experience—improvisational, heartfelt, and always an invitation for the audience to join them on a musical journey that straddles genres and eras. As their following continues to grow, the Kitchen Dwellers have solidified their place at the forefront of a new era in Americana and bluegrass. For this band, the journey is just beginning. Their sound, and their live performances, are shaping the future of what it means to be a bluegrass band in the modern age—and they’re doing it with a unique sense of originality and a fearless willingness to experiment.",
        "Genres": "Bluegrass, Deadgrass, Indie Folk",
        "Scheduled": "Thursday",
        "Stage": "This Tent",
        "StartTime": "4:15 PM",
        "EndTime": "5:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "62",
        "Artist": "Leon Thomas",
        "Description": "Leon Thomas is a multifaceted force in the entertainment world. Born in Brooklyn, New York, his career spans acting, songwriting, and production. At just 10 years old, Thomas first graced the stage as Young Simba in The Lion King on Broadway, quickly building a reputation as a skilled performer. His stage presence would further evolve in productions like Caroline, or Change and The Color Purple, setting the stage for his eventual transition to television and film. Known widely for his role as Andre Harris on Nickelodeon’s 'Victorious', Thomas became a household name among fans of the show. His charm and musical talent on-screen translated effortlessly into a thriving music career, where he earned recognition as a co-producer on Post Malone’s Stoney and a collaborator on Drake’s Certified Lover Boy. These industry accolades only laid the groundwork for what was to come. In 2024, Thomas earned a Grammy Award for his role in co-writing and producing SZA’s hit track “Snooze.” But it’s his solo efforts that have showcased his depth as an artist. His 2018 EP Genesis introduced his emotive approach to music, while 2023’s Electric Dusk album highlighted his growth and experimentation in the genre, blending R&B, soul, and futuristic sounds to offer a fresh take on modern music. Leon Thomas continues to shape the music landscape with his versatile artistry, constantly blurring the lines between actor, singer, songwriter, and producer. With a commitment to expanding his creative horizons, Thomas remains a compelling figure to watch in the years ahead.",
        "Genres": "R&B, Neo Soul",
        "Scheduled": "Friday",
        "Stage": "That Tent",
        "StartTime": "2:45 PM",
        "EndTime": "3:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "63",
        "Artist": "Levity",
        "Description": "Levity, an electronic trio born out of the creative collision between Chicago’s John Hauldren, Los Angeles’s PJ Carberry, and Minnesota’s Josh Tarum, has made waves in the music scene with a sound that effortlessly blends upbeat drums, atmospheric synths, and infectious melodies. Emerging with a fresh energy, their music has captivated listeners worldwide, accumulating over 3 million streams across platforms. Formed with a shared vision of producing electrifying soundscapes that invite listeners to escape reality, Levity’s tracks push the boundaries of electronic music while remaining accessible. Known for their invigorating live performances, the trio has garnered a reputation for engaging the crowd, creating an immersive experience that goes beyond just the music. Their performances are a journey, one that invites fans into their world of euphoria, rhythm, and vibrancy. Levity’s versatility has caught the attention of some of the biggest names in music, with the trio landing official remixes for artists such as Tinashe, Louis The Child, Quinn XCII, Chelsea Cutler, and Silent Child. These collaborations helped to expand their reach and solidify their reputation as a go-to creative force in the electronic scene. As Levity continues to grow and evolve, their ever-expanding fanbase is eagerly anticipating the next chapter in their musical journey. With a distinctive sound and undeniable presence, Levity is undeniably one to watch.",
        "Genres": "EDM, DJ, Trap, Bass, Dubstep",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "7:45 PM",
        "EndTime": "8:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "64",
        "Artist": "LSZee",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "The Other",
        "StartTime": "8:15 PM",
        "EndTime": "9:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "65",
        "Artist": "Luke Combs",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "What Stage",
        "StartTime": "9:00 PM",
        "EndTime": "10:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "66",
        "Artist": "Mannequin Pussy",
        "Description": "Mannequin Pussy, the genre-defying Philadelphia-based rock band, has been leaving an indelible mark on the indie and punk scenes since their inception in 2010. The band’s lineup—led by the dynamic Marisa “Missy” Dabice (vocals, guitar), along with Kaleen Reading (drums), Colins “Bear” Regisford (bass, vocals), and Maxine Steen (guitar)—has consistently delivered an explosive blend of raw energy and unapologetic emotion. From their early days, Mannequin Pussy’s sound was always hard to pin down. They blend the fury and aggression of punk rock with the melodic sensibilities of indie rock, all while embracing a level of noise and chaos that brings the intensity of their live shows to life in the studio. Their music feels like a cathartic release, with the powerful juxtaposition of delicate melodies against a backdrop of distorted, heart-pounding rhythms. Their discography, which includes Mannequin Pussy (2014), Romantic (2016), Patience (2019), and their most recent release I Got Heaven (2024), showcases their evolution and willingness to break free from the boundaries of the genres they inhabit. Every album feels like a different chapter in the band’s journey, yet they remain steadfast in their commitment to crafting visceral, deeply emotional music that resonates long after the last chord fades. Mannequin Pussy’s songs are filled with gritty honesty, raw vulnerability, and a touch of dark humor. Whether through a blistering punk anthem or a more introspective moment, their music creates space for the listener to dive deep into their own emotions. With each release and every performance, the band continues to redefine what it means to push the limits of rock music.",
        "Genres": "Indie Rock, Alternative",
        "Scheduled": "Friday",
        "Stage": "That Tent",
        "StartTime": "4:15 PM",
        "EndTime": "5:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "67",
        "Artist": "Marcus King",
        "Description": "Marcus King is a force of nature, a blazing talent out of Greenville, South Carolina, who’s reshaping what southern rock and blues can be. Born on March 11, 1996, he didn’t just stumble into music—it’s in his blood. His father, Marvin King, a noted blues guitarist, and his grandfather, a local musician, laid the foundation for what’s become a family tradition of soulful storytelling through song. By the time Marcus was eight, he was already sharing stages with his father, and not long after, his searing guitar licks were recorded on one of his dad’s albums. Growing up, King lived and breathed music. While other kids were swapping video games, he was cutting his teeth in the smoky bars of Greenville. His sound—a magnetic blend of soul, blues, and psychedelic southern rock—wasn’t just practiced; it was lived. He honed his skills at the Fine Arts Center under the jazz mentorship of Steve Watson, further refining the artistry that would later take him around the world. His 2020 debut solo album, El Dorado, produced by Dan Auerbach of The Black Keys, wasn’t just an introduction—it was a statement. Nominated for a Grammy in Best Americana Album, it brought raw emotional depth and technical prowess to the forefront. But King didn’t stop there. His follow-up, Young Blood (2022), smashed onto the scene, taking the number one spot on the Billboard Top Blues Albums chart. It’s the kind of record that doesn’t just ask for your attention—it demands it, with every note crackling with authenticity. Seeing Marcus King live is a revelation. Whether it’s his gritty, soulful vocals or the way his guitar sings, each performance is an intimate conversation between artist and audience. His music feels like a journey, one that walks the line between past and present, between southern traditions and boundary-pushing innovation. King’s story is still being written, but one thing is clear—he’s not just playing the blues; he’s redefining them for a new generation.",
        "Genres": "Blue Rock, Southern Rock",
        "Scheduled": "Thursday",
        "Stage": "What Stage",
        "StartTime": "7:15 PM",
        "EndTime": "8:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "68",
        "Artist": "Marina",
        "Description": "Marina Lambrini Diamandis, known simply as Marina, has steadily cultivated a reputation as one of pop’s most distinct and daring voices. Born on October 10, 1985, in Brynmawr, Wales, to a Greek father and a Welsh mother, Marina’s journey to the top was anything but conventional. Leaving behind her hometown and her formal musical training, she moved to London in her teens, drawn to the vibrancy of the city’s music scene. It was there that she began shaping the artistic persona that would come to define her career. Her debut EP, Mermaid vs. Sailor (2007), was the first glimpse of the prodigious talent she would go on to develop, but it was her 2009 single, “Obsessions,” paired with the uniquely quirky “Mowgli’s Road,” that first set her apart. The buzz surrounding her music reached a fever pitch after Marina was named runner-up in the BBC’s Sound of 2010 poll. This recognition was the beginning of an impressive trajectory, with her debut full-length album, The Family Jewels (2010), propelling her into the mainstream. Marina’s career continued to evolve with the release of Electra Heart (2012), an album that saw her shift into more polished, mainstream pop while still maintaining her penchant for deeply introspective lyrics. The album, alongside tracks like “Primadonna” and “How to Be a Heartbreaker,” explored the complexities of femininity, love, and the pressures of societal expectation, cementing her as an artist unafraid to tackle the personal and political within the realm of pop music. Her subsequent works, Froot (2015) and Love + Fear (2019), took listeners on an even deeper journey into the mind of an artist constantly reinventing herself while remaining grounded in themes of self-reflection and emotional vulnerability. Froot, an album praised for its lush arrangements and introspective depth, marked Marina’s artistic maturity, with tracks like “Happy” and “Blue” standing as anthems of personal growth and empowerment. Marina’s most recent project, Eat the World (2024), a debut poetry collection, marks another ambitious step for the artist, with a keen focus on the internal world and navigating the complexities of adulthood. The poetry, reflecting her own experiences from adolescence through her mid-30s, speaks to the challenges of balancing fame, identity, and the mundane realities of life. Despite her commercial success, Marina remains an artist who has never let herself be boxed in—her music continues to subvert expectations, and her artistry continues to break new ground. If there’s one thing to expect from Marina, it’s that she’s always reinventing herself while staying true to the themes that have long captivated her fans: identity, love, and the often-complicated relationship between the two.",
        "Genres": "Pop, Electro Pop",
        "Scheduled": "Friday",
        "Stage": "This Tent",
        "StartTime": "9:45 PM",
        "EndTime": "10:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "69",
        "Artist": "Matt Champion",
        "Description": "Matt Champion, born Matthew Garrett Champion, emerges from The Woodlands, Texas, with a style that seamlessly merges raw introspection with a laid-back groove. As a founding member of the genre-bending collective BROCKHAMPTON, Champion’s artistry defies boundaries, delivering verses that are equal parts vulnerable and vibey. Champion’s early solo releases, like “Burn” and “You’re Too Cool for Me,” showcased his lyrical depth and melodic instincts, setting him apart in the crowded SoundCloud scene. When BROCKHAMPTON formed in 2015, his voice became a cornerstone of their kaleidoscopic sound—a mix of hip-hop, R&B, and pop that speaks to the complexities of modern youth. Albums like Saturation (2017), Iridescence (2018), and Ginger (2019) bear the marks of his creative fingerprints, with his smooth delivery often anchoring the group’s dynamic energy. While his contributions to BROCKHAMPTON have been significant, Champion’s solo explorations reveal a quieter, more personal side. His lyrics frequently delve into themes of self-reflection and societal critique, creating a resonance that feels both intimate and universal. Whether crafting hooks that stick in your head or verses that hit straight to the heart, Matt Champion remains a voice for those navigating the complexities of identity and connection in the digital age. Rooted in Texas charm but universally relatable, Champion is more than just a member of a collective; he’s a singular talent carving his own path while redefining what it means to be an artist in today’s musical landscape.",
        "Genres": "Indie Pop, Hip Hop, R&B",
        "Scheduled": "Friday",
        "Stage": "This Tent",
        "StartTime": "2:15 PM",
        "EndTime": "3:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "70",
        "Artist": "Max Styler",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "The Other",
        "StartTime": "6:30 PM",
        "EndTime": "7:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "71",
        "Artist": "Megadeth",
        "Description": "Megadeth—one of the titans of thrash metal—has long stood as a force to be reckoned with in the world of heavy music. Born out of Los Angeles in 1983, the band was founded by Dave Mustaine after his departure from Metallica. From the get-go, Megadeth quickly carved out their own distinct sound, one that combined blistering speed, razor-sharp guitar work, and socially conscious, politically charged lyrics. Alongside bassist David Ellefson, Mustaine assembled a lineup that would evolve over the years, but the vision for the band remained steadfast: to push the limits of metal while staying true to the genre’s roots. Megadeth’s early years were marked by their relentless drive to innovate. Their second album, Peace Sells… but Who’s Buying? (1986), saw them come into their own as not just a thrash band, but as one of the cornerstones of the metal genre itself. Tracks like “Wake Up Dead” and “Peace Sells” became instant classics, anchoring the band’s reputation for both speed and sophistication in songwriting. But it was their 1990 album, Rust in Peace, that cemented their place among the pantheon of metal greats. A technical masterpiece, Rust in Peace is often hailed as one of the greatest metal albums of all time, with tracks like “Holy Wars… The Punishment Due” and “Tornado of Souls” showcasing Megadeth’s unrivaled musical complexity and intensity. Over the years, Megadeth’s music has remained an unflinching commentary on war, politics, religion, and personal struggle, tackling heavy themes with a blend of aggression and intellectualism that few others in metal can match. They’ve weathered lineup changes, personal battles, and the ups and downs of the music industry, but through it all, Megadeth has remained steadfast in their pursuit of musical excellence. Even today, the band continues to make their mark. Whether it’s through albums like Dystopia (2016) or their ongoing tours that bring their heavy-hitting live shows to fans around the globe, Megadeth’s influence is undeniable. Along with Metallica, Slayer, and Anthrax, they remain part of the so-called “Big Four” of thrash metal—bands that reshaped the genre and continue to push it forward. For all their hard-hitting, face-melting riffs and lightning-fast solos, Megadeth’s legacy is defined by more than just their sound—it’s their refusal to back down from anything. They’ve stayed true to their mission for over three decades: make bold music that challenges the status quo. And in a world where few things stay the same, Megadeth’s commitment to their craft remains unwavering.",
        "Genres": "Heavy Metal, Thrash Metal",
        "Scheduled": "Friday",
        "Stage": "That Tent",
        "StartTime": "12:45 AM",
        "EndTime": "2:00 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "72",
        "Artist": "MJ Lenderman",
        "Description": "MJ Lenderman is a name that feels as unassuming as his music, yet his blend of raw indie rock, dark humor, and subtle existentialism has carved out a space for him in the indie scene. Hailing from Asheville, North Carolina, Lenderman’s musical roots run deep, with his great-grandfather being the jazz musician Charlie Ventura. This family legacy undoubtedly influenced his early guitar work, which led to him co-founding the band Wednesday and ultimately stepping out on his own. In 2022, Lenderman dropped Boat Songs, his solo debut—a collection of sardonic reflections on life’s trivialities, relationships, and the quiet absurdities that define human existence. The album’s lo-fi charm and candid lyricism resonated with listeners who found solace in its balance of bleakness and dry wit. His gritty, almost unpolished approach to songwriting paired with a biting sense of humor made him an unexpected voice for those yearning for indie rock with a bit of bite. Building on the momentum of his debut, Lenderman released Manning Fireworks in 2024—a follow-up that ups the ante. With tracks that tackle existential crises head-on, this record continues to reveal the deeply human side of his songwriting. Lenderman’s style remains grounded in stripped-back, scrappy indie rock with lyrics that touch on the emotional messiness of being alive—yet it is his subtle ability to turn these moments into poignant, darkly humorous stories that set him apart from his peers. Despite gaining a larger following, Lenderman has remained somewhat of a mystery, opting to stay out of the spotlight. He recently distanced himself from social media, instead choosing to focus on what really matters: his music. His low-profile approach to fame, combined with his authenticity, offers a refreshing contrast to the typical pressures of the industry. At his core, Lenderman is about sustaining a creative journey that stays true to himself—musically and personally. For those seeking something real and introspective in the indie rock scene, MJ Lenderman is the one to watch. His music is a deep dive into the human condition, served with a side of wry commentary that cuts through the noise.",
        "Genres": "Americana, Indie Rock",
        "Scheduled": "Friday",
        "Stage": "This Tent",
        "StartTime": "5:15 PM",
        "EndTime": "6:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "73",
        "Artist": "Modest Mouse",
        "Description": "Modest Mouse, formed in 1993 in Issaquah, Washington, is an American alternative rock band renowned for their eclectic sound and introspective lyrics. The founding members—lead vocalist and guitarist Isaac Brock, bassist Eric Judy, and drummer Jeremiah Green—established a foundation that would evolve through various lineup changes over the years. Their 1996 debut album, This Is a Long Drive for Someone with Nothing to Think About, introduced their unique blend of indie rock, characterized by raw emotion and experimental instrumentation. The 1997 follow-up, The Lonesome Crowded West, garnered critical acclaim and solidified their reputation in the indie music scene. In 2004, Modest Mouse achieved mainstream success with Good News for People Who Love Bad News, featuring the hit single “Float On.” This album marked a significant milestone, earning them Grammy nominations and expanding their audience. The band’s discography continued to evolve with albums like We Were Dead Before the Ship Even Sank (2007), which included contributions from guitarist Johnny Marr, and Strangers to Ourselves (2015). Their latest album, The Golden Casket, was released in 2021, showcasing their ongoing innovation and relevance in the music industry. Modest Mouse remains a significant influence in the alternative rock genre, known for their willingness to experiment and their ability to resonate with a diverse audience.",
        "Genres": "Indie Rock, Alternative",
        "Scheduled": "Saturday",
        "Stage": "That Tent",
        "StartTime": "9:15 PM",
        "EndTime": "10:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "74",
        "Artist": "Mt. Joy",
        "Description": "Mt. Joy, an American indie rock band, has been captivating audiences with their evocative storytelling and dynamic sound since their formation in 2016. The band comprises Matt Quinn (vocals, guitar), Sam Cooper (guitar), Michael Byrnes (bass), Sotiris Eliopoulos (drums), and Jackie Miclau (keyboards). The band’s name pays homage to Mount Joy, a peak in Pennsylvania’s Valley Forge National Historical Park, near Cooper’s childhood home. In 2016, Quinn and Cooper reunited in Los Angeles, reigniting their musical collaboration. They released their debut single, “Astrovan,” in 2017, followed by “Sheep,” “Cardinal,” and “Silver Lining.” Their self-titled debut album, Mt. Joy, was released on March 2, 2018, featuring tracks like “Silver Lining,” which became a viral hit, reaching number one on the Billboard Triple A charts. The band’s second album, Rearrange Us, was released on June 5, 2020, showcasing their growth and versatility. Their third album, Orange Blood, released on June 17, 2022, continued their exploration of indie rock and folk influences. Mt. Joy continues to captivate audiences with their authentic storytelling and dynamic performances, solidifying their status as a rising star in the indie rock community.",
        "Genres": "Indie Folk, Indie Rock",
        "Scheduled": "Saturday",
        "Stage": "Which Stage",
        "StartTime": "7:30 PM",
        "EndTime": "8:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "75",
        "Artist": "Natasha Bedingfield",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "This Tent",
        "StartTime": "2:45 PM",
        "EndTime": "3:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "76",
        "Artist": "Nelly",
        "Description": "Cornell Iral Haynes Jr., known professionally as Nelly, is an American rapper, singer, and entrepreneur whose influence has left an indelible mark on the hip-hop and pop music landscapes. Born on November 2, 1974, in Austin, Texas, Nelly relocated to St. Louis, Missouri, during his youth, where he would later form the hip-hop group St. Lunatics in 1993. The group achieved local success with their self-produced single “Gimme What You Got,” but it was Nelly’s solo career that propelled him to national prominence. In 2000, Nelly released his debut album, Country Grammar, which debuted at number one on the Billboard 200 chart and was certified diamond by the Recording Industry Association of America (RIAA). The album featured the hit singles “Country Grammar (Hot Shit)” and “Ride wit Me,” both of which entered the top ten of the Billboard Hot 100. Nelly’s follow-up album, Nellyville (2002), continued his commercial success, spawning two consecutive Billboard Hot 100 number-one singles: “Hot in Herre” and “Dilemma” (featuring Kelly Rowland). The album also included the top-five single “Air Force Ones” (featuring Murphy Lee and St. Lunatics). Throughout his career, Nelly has ventured into acting, appearing in films such as The Longest Yard (2005) and Scary Movie 5 (2013). He has also engaged in various entrepreneurial endeavors, including his clothing line, Apple Bottoms, and his involvement in the energy drink industry. As of January 2025, Nelly is set to embark on the “Where The Party At Tour” in celebration of the 25th anniversary of his debut album, Country Grammar. The tour will span 54 dates across New Zealand, Australia, Canada, Europe, and the United States, featuring special guests such as Ja Rule, Eve, St. Lunatics, Fabolous, Jermaine Dupri, and Chingy. Fans can anticipate performances of his classic hits, including “Hot in Herre,” “Dilemma,” and “Ride Wit Me.” Nelly’s enduring impact on the music industry is evident through his chart-topping singles, successful albums, and continued relevance in the entertainment world. His ability to blend hip-hop with pop sensibilities has garnered him a diverse fan base and critical acclaim, solidifying his legacy as a pivotal figure in the evolution of modern music.",
        "Genres": "Rap, Hitmaker, Hip-Hop",
        "Scheduled": "Saturday",
        "Stage": "Which Stage",
        "StartTime": "9:30 PM",
        "EndTime": "10:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "77",
        "Artist": "Of the Trees",
        "Description": "Of The Trees, the sonic alter ego of Tyler Coombs, is not your average electronic artist. With a sound that feels more like a living organism than an album track, Of The Trees has cultivated a deep, immersive musical world that reflects the natural landscape around him. Hailing from Portland, Maine, and now residing in Denver, Colorado, Coombs has spent over a decade crafting intricate soundscapes that blend organic rhythms with earth-shattering bass. His music is both an escape and an invitation, luring listeners into an experience that is as much about texture as it is about melody. Coombs’ career took a leap in 2015 when Bassnectar featured his remix of “One Thing” on his Into The Sun LP. This breakthrough moment saw Of The Trees catapulted into the limelight, earning him a place in the hearts of fans and other top-tier electronic artists. From there, the music flowed, and in 2017, Coombs released his debut album, Dream Atlas, which solidified his reputation as a producer capable of balancing complexity and accessibility. His later collaborations with Deltanine and his 2019 Tanglewood EP revealed a more evolved version of his sound, which draws from ambient, downtempo, and experimental influences. Of The Trees has taken his immersive sound to live shows across the country, sharing the stage with electronic heavyweights like Bassnectar, CloZee, and Tipper. His live sets are experiences in and of themselves—hypnotic, dynamic, and always shifting. With every beat, Coombs explores the intersection between nature’s rhythm and the digital world, making each set a transcendental journey for the audience. If you’ve been to one of his shows, you’ve felt it: the pulse, the drive, the atmosphere that envelops you, pulling you into the moment. Of The Trees is more than just music—it’s a mood, a message, and a sonic vision all wrapped in one.",
        "Genres": "EDM, DJ, Bass, Downtempo, Wubz",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "12:00 AM",
        "EndTime": "1:00 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "78",
        "Artist": "Olivia Rodrigo",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "What Stage",
        "StartTime": "10:30 PM",
        "EndTime": "12:00 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "79",
        "Artist": "Queens of the Stone Age",
        "Description": "Queens of the Stone Age (QOTSA) emerged from the arid landscapes of Palm Desert, California, in 1996, founded by guitarist and vocalist Josh Homme. Evolving from the ashes of stoner rock pioneers Kyuss, QOTSA has become a formidable force in rock music, known for their heavy riffs, intricate rhythms, and Homme’s distinctive falsetto vocals. Their self-titled debut album in 1998 introduced a raw, unfiltered sound that set the stage for their future endeavors. The 2000 release of Rated R marked a significant evolution, incorporating a broader range of influences and featuring collaborations with artists like Josh Homme’s former Kyuss bandmate, Nick Oliveri. This album garnered critical acclaim and solidified their reputation as innovators in the rock genre. In 2002, QOTSA released Songs for the Deaf, an album that achieved commercial success and earned them a Grammy nomination for Best Rock Album. The 2005 album Lullabies to Paralyze continued their exploration of dark, brooding themes, while 2007’s Era Vulgaris showcased a more experimental side, blending electronic elements with their signature hard rock sound. After a brief hiatus, QOTSA returned in 2013 with …Like Clockwork, an album that received widespread critical acclaim and debuted at number one on the Billboard 200 chart. Their 2017 album Villains continued their tradition of blending heavy rock with danceable grooves, further cementing their status as one of the most influential rock bands of their generation. Throughout their career, Queens of the Stone Age has been celebrated for their ability to blend heavy rock with melodic sensibilities, creating a sound that is both accessible and challenging. Their willingness to experiment with different genres and sounds has kept them at the forefront of the rock scene, earning them a dedicated fan base and critical acclaim.",
        "Genres": "Stoner Rock, Hard Rock, Alternative",
        "Scheduled": "Sunday",
        "Stage": "Which Stage",
        "StartTime": "8:15 PM",
        "EndTime": "9:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "80",
        "Artist": "Rachel Chinouriri",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Which Stage",
        "StartTime": "2:30 PM",
        "EndTime": "3:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "81",
        "Artist": "Rainbow Kitten Surprise",
        "Description": "Rainbow Kitten Surprise has become one of the most electrifying and emotionally resonant names in indie rock, blending raw vulnerability with genre-defying sound. Formed in 2013 at Appalachian State University in Boone, North Carolina, the band’s lineup has evolved over the years, with founding members Sam Melo and Darrick “Bozzy” Keller recruiting Ethan Goodpaster, Jess Haney, and Charlie Holt to complete their lineup. Their ability to merge folk, rock, and alternative influences has created a sound that feels timeless and fiercely modern, a sound that pulls listeners in, compelling them to sit with their emotions and never shy away from authenticity. Their debut album, Seven, was released independently in 2015 and helped to establish them as a force within the underground scene. A few years later, the band re-released Seven as Seven + Mary, combining their early work and showcasing their ability to evolve musically while staying true to the raw emotional core of their sound. But it was 2018’s How To: Friend, Love, Freefall—released under Elektra Records—that truly launched them into the mainstream, particularly with the breakout single “Hide,” which would become a defining track of their career. The song’s haunting and heartfelt delivery was a clear reflection of the band’s ability to intertwine intimate storytelling with infectious melodies. In 2022, the band’s lead vocalist, Ela Melo, made a deeply personal revelation when she publicly came out as transgender, marking a pivotal moment in both her own life and the band’s. Her bravery has added even more depth to the emotional resonance of their music, giving their already powerful lyrics a new level of authenticity. With their fourth studio album, Love Hate Music Box, released in 2024, Rainbow Kitten Surprise has evolved yet again, crafting a collection of songs that reflect the hardships Melo faced over the past six years. The album feels like a reckoning, one that’s been earned through personal trials, and it’s a powerful testament to the band’s journey. It’s music that’s meant to be felt as much as it’s meant to be heard—a sonic space where joy and pain exist in equal measure. Rainbow Kitten Surprise isn’t just a band; they are a living, breathing force in indie rock—one that continues to redefine what it means to be vulnerable in the public eye. Every record, every performance, is another chapter in their ongoing exploration of self, love, and all the complexities in between.",
        "Genres": "Folk Rock, Indie Rock, Alternative Rock",
        "Scheduled": "Friday",
        "Stage": "That Tent",
        "StartTime": "9:30 PM",
        "EndTime": "10:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "82",
        "Artist": "Raye",
        "Description": "Raye, born Rachel Agatha Keen on October 24, 1997, in Tooting, London, is an artist who carved her own path to stardom in an industry where expectations often loom large. Raised in a musical family, Raye’s upbringing nurtured her creative spirit from a young age. Her parents met at church, and her grandfather’s influence as a musician and songwriter set the stage for her own artistic journey. By the age of ten, she was already penning her first songs, shaping her voice before the world could even hear it. Her breakout moment arrived in 2016, when Raye featured on Jonas Blue’s “By Your Side” and Jax Jones’s smash hit “You Don’t Know Me.” Both tracks not only charted internationally but also became platinum-certified, marking the beginning of Raye’s ascent in the music world. Yet, it wasn’t until 2022 that the singer-songwriter truly found her global breakout moment with the release of “Escapism,” a hauntingly catchy track featuring 070 Shake. The song went viral on TikTok, thrusting Raye into the international spotlight, and quickly became one of the most talked-about tracks of the year. Breaking free from a major label contract, Raye reclaimed her narrative and independence, releasing her debut album My 21st Century Blues in 2023. The album was both a critical and commercial success, cementing Raye’s reputation as a boundary-pushing, genre-defying artist. The album’s raw, personal themes and experimental production earned her nominations for prestigious accolades, including a Mercury Prize nod. Raye’s self-determination and unapologetic storytelling quickly garnered respect, not just as a performer but as a fiercely independent artist in a landscape increasingly dominated by corporate pressures. By 2024, Raye had already become an icon of the new era. At the Brit Awards, she made history by sweeping six awards, including Artist of the Year and Best Album, a record-breaking achievement that solidified her position as one of the leading figures in contemporary music. Known for her genre-bending style that blends elements of pop, R&B, and electronic music, Raye continues to break barriers with her powerful voice and bold, unfiltered lyrics. The journey of this self-made artist has just begun, and with the momentum behind her, the world can expect many more milestones to come.",
        "Genres": "Pop, R&B",
        "Scheduled": "Saturday",
        "Stage": "What Stage",
        "StartTime": "4:30 PM",
        "EndTime": "5:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "83",
        "Artist": "Remi Wolf",
        "Description": "Remi Wolf, born on February 2, 1996, in Palo Alto, California, is a dynamic singer-songwriter celebrated for her eclectic blend of pop, funk, and lo-fi bedroom pop. Raised in a multicultural household with a Sicilian mother and a Russian-Persian father, she was exposed to diverse sounds and artistic expressions from an early age, shaping her unique musical sensibilities. Wolf’s musical journey began in her teenage years, where she showcased her talents by auditioning for American Idol during her senior year of high school. She later attended the University of Southern California, where she studied jazz vocals, further honing her musical abilities. In 2019, Wolf released her debut EP, You’re a Dog! which garnered attention for its catchy melodies and candid lyrics. Her 2021 debut album, Juno, was produced in her bedroom during the COVID-19 pandemic, reflecting her DIY ethos and resilience. In July 2023, Wolf released her sophomore album, Big Ideas, recorded in esteemed studios like Electric Lady and Conway. This album showcases her experiments with jazz and disco influences, continuing her exploration of fluid sexuality and personal growth. Wolf’s rise to fame has been marked by her distinctive sound and personal growth, culminating in her recently released sophomore album, Big Ideas. After debuting in 2019, Wolf gained attention quickly and released her first album, Juno, in 2021. Her latest album reflects on her 20s, navigating sobriety following a stint in rehab prompted by the COVID-19 pandemic, and the challenges of constant touring. Throughout her career, Wolf has performed with renowned artists like Lorde, Paramore, and Olivia Rodrigo, where she honed her ability to connect with large audiences. Her live performances are celebrated for their energy and authenticity, resonating deeply with fans worldwide.",
        "Genres": "Indie Pop, Funk",
        "Scheduled": "Sunday",
        "Stage": "What Stage",
        "StartTime": "5:15 PM",
        "EndTime": "6:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "84",
        "Artist": "Remi Wolf's 1970's Pool Party Superjam",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "This Tent",
        "StartTime": "8:45 PM",
        "EndTime": "10:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "85",
        "Artist": "RL Grime",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "10:00 PM",
        "EndTime": "11:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "86",
        "Artist": "Role Model",
        "Description": "Role Model, the music project of Tucker Harrington Pillsbury, has quietly become one of the most compelling voices in the indie pop and bedroom pop scene. Hailing from Cape Elizabeth, Maine, Role Model’s evolution is marked by raw honesty and a fearless approach to tackling themes of mental health, self-reflection, and personal growth. Since releasing his debut EP, Arizona in the Summer, in 2017, Role Model quickly garnered attention for his emotionally charged lyrics and a sound that blends wistful melodies with a laid-back pop sensibility. His rise was cemented with the release of oh, how perfect in 2019, followed by our little angel in 2020, both of which cemented his status as an artist unafraid to lay bare the complexities of relationships and the human experience. His debut album, Rx, in 2022, marked a more refined, yet still deeply personal chapter in his career, with each song exploring themes of self-doubt, longing, and the highs and lows of love. In 2024, Role Model released Kansas Anymore, an album that further establishes his vulnerability as a musical strength, while continuing to forge a path all his own in the industry. Not just a voice of emotional clarity for his fans, Role Model’s authenticity extends beyond the music, as he remains outspoken about his mental health struggles, building a connection with listeners who see themselves in his words. Recognized by People magazine as one of 2024’s Ones to Watch, Role Model’s growing influence proves that, in a world where oversaturation can often hinder individuality, his willingness to be vulnerable and true to himself has placed him at the forefront of indie pop’s most promising figures. As his sound continues to evolve and his fanbase grows, Role Model is more than just an artist—he’s a voice for those navigating the complexities of life, self, and connection. With each new release, he draws listeners into a world that is both deeply personal and universally relatable, making him one of the most exciting and important acts in the scene today.",
        "Genres": "Bedroom Pop, Indie Pop",
        "Scheduled": "Sunday",
        "Stage": "What Stage",
        "StartTime": "3:30 PM",
        "EndTime": "4:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "87",
        "Artist": "Rossy",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "5:00 PM",
        "EndTime": "6:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "88",
        "Artist": "Royel Otis",
        "Description": "Royel Otis, the Sydney-based indie pop duo, has swiftly become a standout act in the Australian music scene. Formed in 2019, the collaboration between vocalist Otis Pavlovic and guitarist Royel Maddell was described by Pavlovic as “the collaboration he’d been chasing his whole life.” Their debut EP, Campus, released in October 2021, introduced listeners to their breezy, surf rock-inspired sound. The 2022 single “Oysters in My Pocket” marked a significant evolution in their musical style, showcasing their growth and artistic maturity. In February 2024, Royel Otis released their debut studio album, Pratts & Pain, which debuted at number one on the ARIA Australian Albums Chart. The deluxe version, PRATTS & PAIN – It Ain’t Over Til It Ends, dropped in October 2024, featuring new tracks like “Til The Morning,” “Claw Foot,” and “Merry Mary Marry Me.” Their cover of Sophie Ellis-Bextor’s “Murder on the Dancefloor” for Triple J’s “Like a Version” in January 2024 went viral, reaching number one on the US Alternative Radio Chart in June. A subsequent cover of The Cranberries’ “Linger” in April 2024 became a global hit, entering the Billboard Hot 100 in August 2024. In November 2024, Royel Otis signed with Capitol Records, marking a significant milestone in their burgeoning career. With their infectious melodies and authentic chemistry, Royel Otis continues to captivate audiences worldwide, solidifying their place as one of Australia’s most promising musical acts.",
        "Genres": "Indie Rock, Alt-Pop",
        "Scheduled": "Sunday",
        "Stage": "Which Stage",
        "StartTime": "4:30 PM",
        "EndTime": "5:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "89",
        "Artist": "Saint Motel",
        "Description": "Saint Motel, the Los Angeles-based indie pop band, has been captivating audiences with their vibrant, art-pop sound since 2009. Formed by vocalist A/J Jackson and guitarist Aaron Sharp, who met at film school, the band draws from their shared love of obscure cinema, blending their visual creativity into their music and performances. Joined by bassist Dak Lerdamornpong and drummer Greg Erwin, Saint Motel’s lineup solidified into one of the most distinct acts in the indie pop world. Their journey began with the 2009 release of ForPlay, an EP that showcased their playful take on alternative pop. This was followed by their first full-length album, Voyeur, released in 2012. With its infectious hooks and eclectic mix of indie pop and alternative rock, Voyeur established Saint Motel as one of the rising stars of the LA music scene. Their sound, a slick fusion of Tropicalia influences with punchy indie pop, became their trademark. 2016 saw the release of saintmotelevision, their highly anticipated second album, which peaked at #62 on the Billboard 200 chart. The album continued their exploration of vibrant soundscapes and included visually immersive elements that had become synonymous with their live performances. Known for their playful use of visuals and stage presence, Saint Motel’s music is as much an experience as it is a listening session. Today, Saint Motel remains one of the most exciting acts in indie pop, their unique sound continuing to evolve with each release. With a dedicated fanbase and a knack for pushing the boundaries of art and music, they stand out as a band unafraid to defy conventions, both sonically and visually.",
        "Genres": "Indie Pop, Pop Rock",
        "Scheduled": "Sunday",
        "Stage": "This Tent",
        "StartTime": "4:15 PM",
        "EndTime": "5:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "90",
        "Artist": "Sammy Virji",
        "Description": "Sammy Virji is carving his own path through the UK electronic music scene, and if you haven’t yet heard of him, you’re about to. Emerging from the heart of the UK garage and bassline movements, Virji blends infectious hooks with gritty, bass-heavy rhythms, creating a sound that hits hard and keeps you moving. Born in London and raised in Witney, this prodigious talent was shaped by a diverse musical upbringing—his father, a singer-songwriter, provided the soundtrack to Sammy’s early years. The journey to music wasn’t immediate. Virji initially attended Newcastle University, but like many artists before him, the pull of his passion for music was stronger than any academic path. So, he made the leap into music full-time, and it wasn’t long before he caught the attention of the scene with his unmistakable sound. Tracks like “Daga Da” and “Find My Way Home” quickly became fan favorites, and it’s easy to see why—Virji doesn’t just make music; he crafts an experience, one that blends the raw, rhythmic pulse of garage with the smooth groove of bass house. His music brings energy, it brings vibe, and above all, it brings the kind of heat you can’t ignore. Virji’s recent releases, including “Moonlight” and “Summertime Blues,” continue to prove that he’s an artist in full control of his sound. They capture the essence of those late-night, feel-good vibes, and there’s something undeniably magnetic about the way his tracks build, drop, and evolve. Every beat feels deliberate, each transition seamless—a masterclass in how to craft bangers that stick with you long after the track ends. But Sammy Virji isn’t just about what’s already been made; he’s always looking forward. As his career continues to rise, expect even more innovative releases that push the boundaries of UK bass music. He’s here to stay, and with every new track, he invites listeners into his evolving world—one track, one night, and one crowd at a time.",
        "Genres": "EDM, DJ, Bass House, Garage, Grime",
        "Scheduled": "Thursday",
        "Stage": "The Other",
        "StartTime": "9:00 PM",
        "EndTime": "10:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "91",
        "Artist": "Slightly Stoopid",
        "Description": "Slightly Stoopid, the genre-bending collective from Ocean Beach, California, has been an unrelenting force in the music world since their formation in 1994. Founded by multi-instrumentalists Kyle McDonald and Miles Doughty, the band’s distinctive sound seamlessly blends a heady mix of rock, reggae, folk, blues, hip-hop, funk, punk, and metal—creating a vibe that defies classification. From the beginning, they embodied a DIY ethos, attracting fans with their unpolished yet infectious sound that captured the carefree energy of California’s coastal lifestyle. The band’s early days saw them gain attention with their gritty, raw performances, which eventually led to a signing by Bradley Nowell of Sublime to his Skunk Records label. The link between the two bands was clear, as both found inspiration in the same fusion of genres and rebellious spirit. Slightly Stoopid’s debut album, Slightly Stoopid (1996), set the stage for what would become an enduring career, but it was their 2003 release, Everything You Need, that marked a shift into more polished and professional territory, while still staying true to their roots. Over the years, Slightly Stoopid has expanded their reach through relentless touring and the release of multiple albums, culminating in the 2018 album Everyday Life, Everyday People. The record represents a fresh chapter for the band, bringing in new textures and layers to their already broad musical palette. The band’s music—spanning from the soulful reggae of “Closer to the Sun” to the bluesy grooves of “The Prophet” and the rap-rock stylings of “2 AM”—has earned them a dedicated following, allowing them to pack venues from coast to coast. The hallmark of their sound lies in their ability to create music that is both laid-back and socially conscious, offering a soundtrack to the everyday lives of their fans. More than just musicians, Slightly Stoopid is a cultural institution, creating music that transcends genres and resonates with people from all walks of life. With a catalog that spans over two decades and a discography that includes albums such as Top of the World (2012) and Everything You Need (2003), Slightly Stoopid continues to prove that their versatility and vision have no limits. Whether they’re making reggae anthems or collaborating with artists like Snoop Dogg, the band remains a symbol of musical evolution.",
        "Genres": "Ska, Reggae, Hip Hop, Rock",
        "Scheduled": "Friday",
        "Stage": "Which Stage",
        "StartTime": "4:00 PM",
        "EndTime": "5:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "92",
        "Artist": "Sofia Isella",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "That Tent",
        "StartTime": "4:45 PM",
        "EndTime": "5:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "93",
        "Artist": "Tape B",
        "Description": "Tape B, born Kemal Berk Alkanat, has rapidly become one of the most exciting and dynamic figures in the world of electronic music. Originally hailing from Turkey, but growing up in the U.S. from the age of three, his sound embodies the collision of old-school dubstep and modern bass music, with a dash of hip-hop influences to round out the experience. Tape B’s style is a constant evolution—refusing to be boxed into any one genre, his tracks are constantly challenging expectations and delivering something fresh with every release. Since his emergence onto the scene, Tape B has captivated fans with his deft ability to blend nostalgia with innovation. There’s a sense of timelessness to his work, where you can hear influences of old-school dubstep, yet his beats pulse with the energy of today’s cutting-edge electronic music. Tracks like “Under Control” are charged with bass-heavy drops and intricate rhythms, seamlessly melding hip-hop influences with dubstep’s gritty, low-end power. It’s this blending of genres that has made him a standout, earning a place in both the hip-hop and EDM circles. Based out of South Florida, Tape B is also known for his live sets, where his high-energy performances serve as an unforgettable experience. His DJ sets aren’t just about playing tracks—they’re an art form, taking fans on a journey through sound, pulling them deeper into the groove as each drop hits. This energy is reflected not only in his performances but also in his growing body of work, which includes a series of well-received releases, collaborations, and remixes. Tape B’s music is an ode to the past while also pushing the boundaries of what’s possible in the future of electronic music. With his innovative approach to production, it’s clear that Tape B is here to stay, continuing to carve his own lane in the crowded world of bass music and hip-hop.",
        "Genres": "EDM, DJ, Bass, Trap, Dubstep",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "10:15 PM",
        "EndTime": "11:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "94",
        "Artist": "The Droptines",
        "Description": "The Droptines, a band born from the rugged landscape of Concan, Texas, have crafted a sound that intertwines alternative country with a deep sense of storytelling and authenticity. Formed in 2019, the group is led by Conner Arthur, whose gravelly vocals and poignant lyrics resonate with the kind of hard-earned wisdom that comes from living in the Texas Hill Country. With Dillon Sampson on bass, Tyler Quade on lead guitar, and Colt Wrangler on drums, the band builds a rich sonic palette that speaks to both the struggles and triumphs of life in the heart of Texas. Their sound is a blend of Americana, alt-country, and rock, each song grounded in earthy storytelling. The Droptines’ music is steeped in a mix of personal reflection and larger-than-life narratives, from biblical tales to unflinching truths that cut deep. Each track feels like an invitation to sit around a campfire, share tales, and listen to the wind whisper through the trees—at once nostalgic and fresh. In 2020, the band dropped their self-titled album, and since then, they’ve gone on to release a series of EPs, quickly building a reputation for their unique fusion of timeless country influences and modern sound. Their music feels lived-in, with roots that run deep into Texas soil but branches that stretch far beyond. They’ve already shared the stage with artists like Red Shahan, Jamestown Revival, and Zach Bryan, proving they’re not just another country band—they’re a force to be reckoned with. The Droptines are more than just a band—they’re a representation of a culture, a place, and a sound that refuses to be ignored. Their music is for those who love a good story, who appreciate authenticity, and who aren’t afraid to get their boots dusty along the way. The road ahead looks bright for these Hill Country sons, and their music will surely continue to strike a chord with anyone who’s ever wandered beneath a Texas sky.",
        "Genres": "Indie Rock, Garage Rock",
        "Scheduled": "Thursday",
        "Stage": "That Tent",
        "StartTime": "3:15 PM",
        "EndTime": "4:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "95",
        "Artist": "The Lemon Twigs",
        "Description": "The Lemon Twigs don’t just play music; they breathe life into it, weaving a narrative of creativity that transcends generations. Hailing from Hicksville, Long Island, the D’Addario brothers—Brian and Michael—have been surrounded by music since birth. Their father, Ronnie, a musician in his own right, and their mother, an actress, fostered an environment where creativity was as natural as breathing. Growing up in such a space, it’s no surprise that Brian and Michael picked up instruments at an early age, carving their own paths with the same passion that had shaped their upbringing. Brian’s journey began with drums at the age of five, quickly followed by guitar at seven, and later branching out into bass and keyboards. Michael, inspired by legends like Keith Moon and Dave Grohl, gravitated toward drums, playing them until he was thirteen. By the time they were ten, both brothers had developed the skill to play multiple instruments, solidifying their reputation as multi-instrumentalists and shaping the core of The Lemon Twigs’ signature sound. Their 2016 debut, Do Hollywood, was a game-changer. Critically acclaimed for its masterful blend of ’60s and ’70s pop influences, the album captured the essence of vintage rock while propelling the band into the contemporary scene. The Lemon Twigs weren’t content with staying in one lane, though. Their 2018 release, Go to School, pushed the boundaries even further, evolving into a rock musical that featured guest appearances from icons like Todd Rundgren and Jody Stephens. This exploration of new frontiers continued with 2020’s Songs for the General Public, where the duo expanded their musical palette even further. Whether performing live or crafting songs in the studio, The Lemon Twigs are known for their unyielding commitment to musical exploration. Their ability to channel classic influences into fresh, modern soundscapes keeps audiences on their toes, eagerly awaiting what comes next. The band’s willingness to blur genres and experiment with new ideas has earned them a dedicated following, and their place in the contemporary rock scene is firmly cemented. With their creativity showing no signs of slowing down, The Lemon Twigs are poised to continue redefining what it means to create timeless music in the modern world.",
        "Genres": "Indie, Baroque Pop, Power Pop",
        "Scheduled": "Thursday",
        "Stage": "This Tent",
        "StartTime": "6:00 PM",
        "EndTime": "7:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "96",
        "Artist": "The Red Clay Strays",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Which Stage",
        "StartTime": "7:30 PM",
        "EndTime": "8:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "97",
        "Artist": "The Stews",
        "Description": "The Stews, a dynamic and hard-hitting indie rock band born out of Auburn University, have quickly made a name for themselves in the Southern music scene. With their explosive sound and a fusion of upbeat, sing-along indie rock tunes, they’ve captured the attention of a growing fanbase. Formed by Preston Hall (vocals, guitar), Blake Dobbs (guitar), Bennett Baugus (bass), and Wyatt Griffith (drums), the band’s chemistry on stage is electric, driving their live performances to a level of intensity that demands attention. The Stews’ debut album, What Was—released in April 2022—marked a defining moment in their career. With tracks that range from anthemic rock ballads to grittier, down-and-dirty riffs, the album solidified the band’s place in the modern indie rock landscape. Following its release, the group embarked on an extensive national tour, traveling from coast to coast, sharing their powerful sound with fans across the country. Their live shows are known for their raw energy, a palpable connection with their audience, and a setlist that spans both What Was and newer material. Rooted in the South but expanding their reach beyond regional confines, The Stews capture the spirit of indie rock with a flavor uniquely their own. With a sound that melds infectious melodies and anthemic choruses, they’ve proven to be one of the most exciting up-and-coming acts to watch. Whether you’re catching them live at an intimate venue or experiencing their larger-than-life presence on stage, The Stews are a force that demands to be heard.",
        "Genres": "Southern Indie Rock",
        "Scheduled": "Saturday",
        "Stage": "This Tent",
        "StartTime": "2:00 PM",
        "EndTime": "2:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "98",
        "Artist": "Thee Sinseers and The Altons",
        "Description": "East Los Angeles has long been a melting pot for musical innovation, and in recent years, two bands have been making waves with their fresh take on retro soul: Thee Sinseers and The Altons. Both groups, while distinct in their approach, share a common thread—the revival of soul’s golden era with a modern spin, blending timeless melodies with today’s sensibilities. What makes them stand out is not only their sound but also the way they craft songs that feel simultaneously nostalgic and fresh. PAGE_BREAK Thee Sinseers PAGE_BREAK Thee Sinseers, led by the multi-talented Joseph Quiñones, are at the forefront of the East L.A. soul revival. As the mastermind behind the project, Quiñones is a versatile artist, weaving together not just the vocals but also producing, playing multiple instruments, and arranging each song with meticulous care. Since forming a few years ago, the band has made a name for themselves with their unique blend of old-school soul, R&B, and a touch of funk. Alongside Quiñones, the band features an impressive group of musicians that truly elevate their sound. The brass section, led by Eric Johnson on tenor sax, Steve Surman on baritone sax, and Joseluis Jimenez on trombone, injects the band’s music with a vibrant energy that’s impossible to ignore. The rhythm section, made up of Christopher Manjarrez on bass, Francisco Flores on guitar, Bryan Ponce on vocals and guitar, Luis Carpio on drums, and Adriana Flores on vocals, adds a rich, groovy foundation that’s essential to their infectious sound. In March 2024, Thee Sinseers released their debut album Sinseerly Yours through Colemine Records, a testament to their artistry and authenticity. With songs that swing with the best of ‘60s soul and groove with the energy of today, their music feels like a revival of forgotten soul classics while staying firmly grounded in the present. PAGE_BREAK The Altons PAGE_BREAK Not content to rest on their laurels, members of Thee Sinseers also have a side project called The Altons, which shares much of the same soul-driven energy but with a slightly different flavor. Drawing inspiration from the lo-fi indie soul movement, The Altons offer a sound that evokes late-night radio sessions and backyard parties. It’s a sound that’s got the raw authenticity of early soul, but with a bit of that modern polish that makes it feel undeniably fresh. With hits like “When You Go (That’s When You’ll Know)” making waves on KCRW’s Today’s Top Tune and their recent single “Tangled Up In You” garnering praise from Soulection Radio, The Altons are proving that they’ve got what it takes to be a force in the contemporary soul scene. Their music feels like a continuation of the laid-back, groove-heavy sounds of the ‘70s, but their touch on it is something distinctly their own. PAGE_BREAK Though Thee Sinseers and The Altons are separate entities, their influence and roots are deeply tied to the East L.A. sound. Their music serves as a reminder of how much soul music has shaped the city’s identity, and they continue to push that legacy forward with every note they play. Whether you’re catching Thee Sinseers live or listening to The Altons’ latest single on your favorite streaming platform, it’s clear that East L.A.’s soul scene is alive and thriving—and it’s artists like these two groups who are helping to lead the charge.",
        "Genres": "Retro Soul, Baroque Pop",
        "Scheduled": "Saturday",
        "Stage": "Which Stage",
        "StartTime": "2:15 PM",
        "EndTime": "3:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "99",
        "Artist": "Tipper",
        "Description": "Tipper’s music is an exploration of sound, a deep dive into the intricate layers of electronic compositions that push boundaries with every track. Born David Tipper in Wimbledon, London, around 1976, his career has been defined by an ever-evolving sonic palette that spans ambient, trip-hop, and uptempo nu skool breaks, among other genres. What has always set Tipper apart is his ability to blend rhythms and atmospheric soundscapes in a way that feels both experimental and accessible, creating a world of sound that envelops the listener entirely. From the very beginning of his career, Tipper demonstrated a mastery of sound design. His work in the studio is a testament to his innovative approach to composition. The layers of his tracks often feel like a conversation between the intricate and the organic, with each beat and sound thoughtfully placed to create something dynamic and complex. It’s this sense of exploration and pushing sonic limits that has earned him a dedicated following among fans of electronic music and beyond. While his catalog spans decades, Tipper’s artistry never rests on past laurels. Each album, each live performance, is an opportunity for him to experiment further, always searching for new ways to create immersive, unforgettable experiences. Whether he’s playing at a festival or releasing new material, the energy and dedication he brings are evident in every piece of work he releases. Tipper’s influence is not just felt in the beats he creates, but also in his approach to the listening experience itself. Renowned for his pioneering work with surround sound composition, his live performances transcend the usual electronic music set, with immersive soundscapes that envelop his audience. It’s a show, a journey, a sonic experience that’s as cerebral as it is visceral. His career, spanning across genres and decades, continues to break new ground, attracting new listeners and captivating those who have followed his journey since the beginning. Tipper is, and always has been, an artist who challenges the boundaries of sound and redefines what it means to create music.",
        "Genres": "EDM, DJ, Ambient, Downtempo, Wubz, Bass",
        "Scheduled": "Friday",
        "Stage": "The Other",
        "StartTime": "1:30 AM",
        "EndTime": "2:30 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "100",
        "Artist": "Treaty Oak Revival",
        "Description": "Treaty Oak Revival, a powerhouse in the country rock scene, is a band that embodies the gritty, unfiltered spirit of West Texas. Formed in 2018 in Odessa, Texas, the band’s blend of Red Dirt country and punk rock energy has earned them a reputation for high-energy live shows and authentic storytelling. With Sam Canty at the helm as lead vocalist and acoustic guitarist, alongside Lance Vanley on rhythm guitar and background vocals, Jeremiah Vanley on lead electric guitar, Andrew Carey on bass, and Cody Holloway on drums, the band creates a sound that is both raw and deeply rooted in the Texas music tradition. The release of their debut studio album, No Vacancy, in January 2021 marked their arrival on the scene. The album was a sonic snapshot of the West Texas landscape, melding country’s storytelling with punk’s unrelenting drive. Critics lauded the album for its authenticity, capturing the band’s ability to bridge the gap between traditional country and modern rock with ease. But Treaty Oak Revival didn’t stop there. In November 2023, they followed up with Have a Nice Day, an album that debuted at number 174 on the Billboard 200 chart—a testament to their growing influence in the music world. With a sound that’s as wide-open as the West Texas skies and a stage presence that can shake the ground beneath you, Treaty Oak Revival continues to resonate with fans of both country and rock music. Their authentic blend of heartfelt lyrics, gritty guitar riffs, and infectious energy positions them as one of the rising stars in the country rock genre. As they continue to carve their path, Treaty Oak Revival is proving they’re not just a band, but a force of nature in the ever-evolving music scene.",
        "Genres": "Country Rock",
        "Scheduled": "Sunday",
        "Stage": "Which Stage",
        "StartTime": "2:45 PM",
        "EndTime": "3:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "101",
        "Artist": "Tyla",
        "Description": "Tyla, born Tyla Laura Seethal on January 30th, 2002, in Johannesburg, South Africa, has swiftly ascended the ranks of the global music scene. Raised in a vibrant, multicultural environment, she embodies the rich tapestry of her heritage, which includes Indian, Zulu, Mauritian, and Irish roots. From a young age, Tyla was immersed in the rhythms of her surroundings, developing a profound connection to music. Her early endeavors in the industry culminated in her 2019 debut single, “Getting Late,” which garnered significant attention and set the stage for her burgeoning career. In 2023, Tyla released “Water,” a track that not only showcased her unique blend of pop and amapiano—a genre rooted in South African jazz and house music—but also propelled her into international acclaim. The song achieved top ten rankings in multiple countries, including South Africa, the United Kingdom, and the United States. Notably, “Water” became the first song by a South African soloist to enter the U.S. Billboard Hot 100 in 55 years and earned her the inaugural Grammy Award for Best African Music Performance. Tyla’s debut self-titled album, released in 2024, received critical acclaim and entered the top 25 in several countries, including the United States. This achievement solidified her status as a formidable force in the music industry. Tyla continues to captivate audiences worldwide with her innovative sound and dynamic performances, embodying the spirit of South Africa’s musical heritage while forging her own path in the global music landscape.",
        "Genres": "Afro Pop",
        "Scheduled": "Saturday",
        "Stage": "That Tent",
        "StartTime": "7:30 PM",
        "EndTime": "8:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "102",
        "Artist": "Tyler, The Creator",
        "Description": "Tyler, The Creator has carved out a unique place for himself in the music world, blurring the lines between hip-hop, alternative, and pop in ways few artists can. Born Tyler Gregory Okonma in Los Angeles on March 6, 1991, his early years set the stage for an artist who would go on to revolutionize not just rap, but fashion, film, and culture at large. His journey began in the gritty streets of Hawthorne, California, where he taught himself the ins and outs of music production, all while crafting album covers for imaginary bands before ever even making his own tracks. This early dive into creative independence laid the foundation for the bold, genre-defying art Tyler would later create. In 2007, Tyler co-founded Odd Future Wolf Gang Kill Them All (OFWGKTA), a collective that shattered norms with its chaotic energy and raw, unapologetic sound. But it wasn’t just about the crew—it was Tyler’s solo work that truly turned heads. His debut album, Bastard (2009), introduced a new voice to hip-hop—one that was dark, raw, and undeniably unique. Goblin (2011) only deepened that reputation, with the breakout single “Yonkers” cementing Tyler’s place in the conversation of influential modern artists. But Tyler wasn’t done yet. With each successive release, he pushed himself further into uncharted territory, never content to sit in one place for too long. Wolf (2013) saw him experimenting with new sounds, while Cherry Bomb (2015) turned the dial up on bold production choices. But it was Flower Boy (2017) that marked a shift in his artistic evolution—blending pop sensibilities with intricate rap and melodies that were, for lack of a better word, beautiful. The album earned him his first Grammy Award for Best Rap Album, a validation of his growth both as a musician and as an artist willing to evolve. By the time IGOR (2019) dropped, Tyler had truly mastered the art of reinvention. The album’s mix of soulful melodies, cutting-edge production, and vulnerability catapulted him into a new realm. His ability to weave complex emotions into his music, paired with an unrelenting push for new sounds, made him a defining figure in contemporary music. His creativity doesn’t stop with music, though. Tyler has taken the same fearless approach to fashion, launching his own lines, Golf Wang and Golf le Fleur, which have garnered attention from brands like Louis Vuitton. And in film, Tyler’s vision comes to life through his work as a director, including his visually stunning Flower Boy and other film projects that reflect his artistic breadth. Tyler’s influence continues to expand, always challenging expectations and continuing to move the conversation forward. Whether it’s through his boundary-pushing music, his collaborations with artists across genres, or his ever-evolving vision in fashion and film, Tyler, The Creator is far from just a rapper. He’s a cultural force that refuses to be pinned down, and with every new project, he leaves a lasting impact on the creative world.",
        "Genres": "Rap, Alternative Hip-Hop, Experimental",
        "Scheduled": "Friday",
        "Stage": "What Stage",
        "StartTime": "11:00 PM",
        "EndTime": "12:15 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "103",
        "Artist": "Vampire Weekend",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "What Stage",
        "StartTime": "7:15 PM",
        "EndTime": "8:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "104",
        "Artist": "Wallows",
        "Description": "Wallows, the Los Angeles-based trio formed in 2011, have steadily established themselves as a key player in the indie rock world. With members Dylan Minnette (vocals and guitar), Braeden Lemasters (vocals and guitar), and Cole Preston (drums), Wallows’ journey began under the name The Narwhals before they refined their sound and identity. The band first caught significant attention with their 2017 debut single, “Pleaser,” which went viral, securing a spot on Spotify’s Global Viral 50 chart. That was only the beginning for them. In 2019, Wallows dropped their debut album, Nothing Happens, which immediately resonated with fans and critics alike. Tracks like “Are You Bored Yet?” perfectly captured the angst and introspection of youthful relationships, propelling them into the indie mainstream. The album’s laid-back yet emotionally charged sound became their trademark, blending catchy melodies with sharp, reflective lyrics. They weren’t just making music—they were capturing a mood, a moment in time that felt universally relatable. The band’s next chapter arrived in 2022 with Tell Me That It’s Over, an album that saw them refine their sound even further. With lead single “Especially You,” Wallows continued to explore complex emotions with a flair for melody that stuck with you long after the song ended. The emotional depth combined with infectious hooks became their signature, keeping listeners coming back for more. But Wallows isn’t one to sit still for long. In 2024, they dropped their third album, Model, a new evolution in their sonic palette. Lead single “Your Apartment” was released alongside an evocative short film, diving deep into the album’s themes of nostalgia and emotional turmoil. It’s a testament to the band’s ability to innovate, expanding their artistic range while staying true to the core of what makes them so captivating: an honest and accessible approach to introspective rock music. Wallows have always been a band of substance. Whether they’re tapping into the frustrations of adolescence or the complex feelings of growing older, their music is a soundtrack for those in the midst of it all. As they continue to evolve and grow, one thing is clear: Wallows is here to stay, and they’re just getting started.",
        "Genres": "Alternative Rock, Indie Pop",
        "Scheduled": "Friday",
        "Stage": "Which Stage",
        "StartTime": "5:45 PM",
        "EndTime": "6:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "105",
        "Artist": "Wave to Earth",
        "Description": "Wave to Earth, an emerging indie rock band from South Korea, has made waves with their unique blend of lo-fi indie pop and jazzy rhythms. Formed in 2019, the trio—comprising Daniel Kim (vocals and guitar), Dong Kyu Shin (drums), and John Cha (bass)—has crafted a sound that is equal parts dreamy and introspective, appealing to listeners across the globe. Their musical journey began with the release of their debut single “wave” in August 2019, immediately showcasing their atmospheric blend of mellow guitar riffs and soft vocals. The following year saw the release of their first EP, Wave 0.01, a project that cemented their signature sound—a mix of light jazz influence and gentle indie pop melodies. In 2020, they followed up with Summer Flows 0.02, further developing their organic, laid-back style. After signing with the independent label Wavy in 2021, which was founded by the well-known artist Colde, Wave to Earth’s visibility expanded both in South Korea and internationally. Their growing reputation led them to perform at major music festivals, including the Seoul Jazz Festival and the Pentaport Rock Festival, earning praise for their effortless live energy. The group’s sound has matured with the release of their highly anticipated first studio album, 0.1 Flaws and All, in 2023. This album represents a new chapter for Wave to Earth, showcasing a deeper dive into the intricacies of their musical expression, from smooth grooves to experimental sonic landscapes. Their hard work and expanding fanbase culminated in a sold-out North American tour in the same year. Their latest album, Play with Earth! 0.03, released in September 2024, is a continued exploration of their innovative sound, offering fresh, exciting textures that build on their previous work while keeping listeners intrigued by their evolving approach. Wave to Earth is undoubtedly a band to watch as they continue to push boundaries within the indie rock and lo-fi scenes.",
        "Genres": "Indie Pop, Korean Pop",
        "Scheduled": "Saturday",
        "Stage": "This Tent",
        "StartTime": "6:45 PM",
        "EndTime": "7:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "106",
        "Artist": "What So Not",
        "Description": "What So Not, the enigmatic Australian electronic producer born Chris Emerson (aka Emoh Instead), has become one of the most significant names in global bass music. His distinctive sound—known for its innovative fusion of genre-blending beats, irresistible rhythms, and bass-heavy drops—first gained massive attention with his remix of Major Lazer’s “Get Free.” This remix, which went viral in 2012, propelled What So Not into the festival circuit, cementing his reputation as a pioneering force in the world of dance music. Emoh Instead’s career took another leap in 2014 when he officially formed What So Not as a duo with Flume. Their partnership produced some of the most iconic tracks in modern electronic music, including the Grammy-nominated “High You Are” and their widely acclaimed “Gemini.” However, after Flume’s departure in 2015, Emerson continued the project solo, releasing a series of groundbreaking singles that pushed the boundaries of both sound and performance. Throughout his career, What So Not has amassed over a billion streams globally, firmly establishing himself in the hearts of fans across the world. His discography, which includes the 2018 EP Divide & Conquer, showcases his ability to blend experimental textures with accessible dance grooves. Always pushing forward, What So Not’s latest body of work, Anomaly (2021), finds Emerson embracing an even more refined sound. The album explores deeper emotional and creative territory, a result of the artist’s introspective pause from touring. What So Not’s music draws from a vast array of influences, seamlessly fusing trap, dubstep, house, and future bass into a hybrid sound that feels equally at home on underground playlists and mainstage festivals. But it’s not just the music that sets What So Not apart. His ability to connect with his fans on a personal level, through both his visuals and storytelling, ensures that every performance is an immersive, unforgettable experience. Whether you’re a long-time listener or a newcomer, the evolution of What So Not is a testament to the artist’s relentless passion for reinvention, staying one step ahead of the curve while maintaining a deep commitment to the genre. As Emerson continues to experiment and evolve, his impact on the global dance music scene remains as vital as ever.",
        "Genres": "EDM, DJ, Future Bass, Trap",
        "Scheduled": "Saturday",
        "Stage": "The Other",
        "StartTime": "6:15 PM",
        "EndTime": "7:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "107",
        "Artist": "Wilderado",
        "Description": "Wilderado isn’t just a band—it’s an experience. Hailing from Tulsa, Oklahoma, this indie folk collective has captured hearts with their expansive sound, blending introspective storytelling with an unmistakable, open-road feel. The trio, made up of Max Rainer (vocals, guitar), Tyler Wimpee (guitar, vocals), and Justin Kila (drums), first crossed paths in college, quickly finding that their combined creative spark could ignite something special. It didn’t take long for them to make a name for themselves. Their debut EP, Misty Shrub, arrived in 2016, but it was their 2017 follow-up, Latigo, that truly started turning heads. The EP garnered over 18 million streams on Spotify, building a passionate fanbase in the process. But it was the 2018 EP Favors that solidified their unique sound—a blend of South-Central Americana and the sun-soaked vibes of Laurel Canyon, as described by Paste. The band’s ability to seamlessly merge indie rock with folk, creating music that’s as expansive as it is intimate, caught the attention of critics and festival-goers alike. Their live shows are something to behold—soaring vocals, rumbling guitars, and a dynamic rhythm section that makes you feel like you’re on a journey with them. They’ve graced the stages of some of the most well-known festivals, including Bonnaroo and Austin City Limits, and shared the stage with artists like Band of Horses and Rainbow Kitten Surprise, creating an undeniable energy with every performance. In 2021, Wilderado released their highly anticipated self-titled debut album, showcasing their signature mix of indie folk and rock. Tracks like “Surefire” and “Head Right” are perfect examples of their ability to craft emotionally resonant songs that still pack a punch. Their 2024 EP Talker further solidifies their place in the indie scene, continuing to evolve and push the boundaries of their sound. With each release, Wilderado is cementing themselves as a force in the indie music world—where storytelling meets a sound that feels both timeless and completely their own. It’s not just music; it’s a feeling. And Wilderado is here to take you on the ride of a lifetime.",
        "Genres": "Indie Folk, Folk Rock, Americana",
        "Scheduled": "Thursday",
        "Stage": "What Stage",
        "StartTime": "5:45 PM",
        "EndTime": "6:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "108",
        "Artist": "Wisp",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "That Tent",
        "StartTime": "7:45 PM",
        "EndTime": "8:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "109",
        "Artist": "YDG",
        "Description": "East Los Angeles has long been a melting pot for musical innovation, and in recent years, two bands have been making waves with their fresh take on retro soul: Thee Sinseers and The Altons. Both groups, while distinct in their approach, share a common thread—the revival of soul’s golden era with a modern spin, blending timeless melodies with today’s sensibilities. What makes them stand out is not only their sound but also the way they craft songs that feel simultaneously nostalgic and fresh.[PAGE_BREAK]Thee Sinseers[PAGE_BREAK]Thee Sinseers, led by the multi-talented Joseph Quiñones, are at the forefront of the East L.A. soul revival. As the mastermind behind the project, Quiñones is a versatile artist, weaving together not just the vocals but also producing, playing multiple instruments, and arranging each song with meticulous care. Since forming a few years ago, the band has made a name for themselves with their unique blend of old-school soul, R&B, and a touch of funk. Alongside Quiñones, the band features an impressive group of musicians that truly elevate their sound. The brass section, led by Eric Johnson on tenor sax, Steve Surman on baritone sax, and Joseluis Jimenez on trombone, injects the band’s music with a vibrant energy that’s impossible to ignore. The rhythm section, made up of Christopher Manjarrez on bass, Francisco Flores on guitar, Bryan Ponce on vocals and guitar, Luis Carpio on drums, and Adriana Flores on vocals, adds a rich, groovy foundation that’s essential to their infectious sound. In March 2024, Thee Sinseers released their debut album Sinseerly Yours through Colemine Records, a testament to their artistry and authenticity. With songs that swing with the best of ‘60s soul and groove with the energy of today, their music feels like a revival of forgotten soul classics while staying firmly grounded in the present. [PAGE_BREAK]The Altons[PAGE_BREAK]Not content to rest on their laurels, members of Thee Sinseers also have a side project called The Altons, which shares much of the same soul-driven energy but with a slightly different flavor. Drawing inspiration from the lo-fi indie soul movement, The Altons offer a sound that evokes late-night radio sessions and backyard parties. It’s a sound that’s got the raw authenticity of early soul, but with a bit of that modern polish that makes it feel undeniably fresh. With hits like “When You Go (That’s When You’ll Know)” making waves on KCRW’s Today’s Top Tune and their recent single “Tangled Up In You” garnering praise from Soulection Radio, The Altons are proving that they’ve got what it takes to be a force in the contemporary soul scene. Their music feels like a continuation of the laid-back, groove-heavy sounds of the ‘70s, but their touch on it is something distinctly their own. [PAGE_BREAK] Though Thee Sinseers and The Altons are separate entities, their influence and roots are deeply tied to the East L.A. sound. Their music serves as a reminder of how much soul music has shaped the city’s identity, and they continue to push that legacy forward with every note they play. Whether you’re catching Thee Sinseers live or listening to The Altons’ latest single on your favorite streaming platform, it’s clear that East L.A.’s soul scene is alive and thriving—and it’s artists like these two groups who are helping to lead the charge.",
        "Genres": "Retro Soul, Baroque Pop",
        "Scheduled": "Sunday",
        "Stage": "The Other",
        "StartTime": "1:45 PM",
        "EndTime": "2:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "110",
        "Artist": "Ziggy Alberts",
        "Description": "Ziggy Alberts, born in 1994 in Australia, is an artist whose trajectory combines raw sincerity and an unwavering commitment to environmentalism. Raised on the Sunshine Coast in Queensland, he was homeschooled until the age of 13, which allowed him to nurture a deep connection to nature—a relationship that resonates deeply within his music. Alberts first found his passion for music in 2010 when his parents gifted him a guitar, sparking a journey that would ultimately lead to an enduring career as a singer-songwriter and environmental advocate. Alberts’ musical catalog is a reflection of his personal journey, his voice a conduit for the stories of love, introspection, and our fragile connection to the planet. He is the co-founder of Commonfolk Records, a platform that has allowed him to share his music globally and support fellow artists. His breakthrough came with Laps Around the Sun (2018), an album lauded for its raw honesty and the seamless blending of folk and pop influences. Tracks like “Gone” and “Runaway” showcased Alberts’ gift for storytelling, where each lyric is a blend of personal narrative and environmental consciousness, giving fans an intimate look at his world. Beyond his music, Alberts has positioned himself as a vocal advocate for climate change awareness. His dedication to sustainability mirrors his artistic approach—he uses his platform not only to entertain but to inspire action. He remains deeply committed to ensuring that the preservation of the environment is always at the forefront of his endeavors, whether through his music, interviews, or the way he lives his life. Alberts’ authentic approach to songwriting and his ability to resonate with fans has garnered him a dedicated, global following. His music isn’t just a reflection of his own life—it’s an invitation to consider the world around us and the future we wish to leave behind. As his career continues to flourish, Ziggy Alberts remains a vital figure in the folk-pop world, using his voice to advocate for a greener, more connected future.",
        "Genres": "Folk, Acoustic, Singer-Songwriter",
        "Scheduled": "Saturday",
        "Stage": "This Tent",
        "StartTime": "3:30 PM",
        "EndTime": "4:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "111",
        "Artist": "Zingara",
        "Description": "Zingara, born Gabrielle Mirabile on September 13, 1998, in Maryland, has rapidly made a name for herself as a dynamic force in the world of bass music. Initially encouraged by a friend to explore music professionally, Zingara’s journey began in 2017, when she pivoted from videography to DJing, performing in local venues around Towson, Maryland. This transition marked the beginning of a creative evolution that would see her become a prominent figure in the bass music scene. Her unique sound—intertwining deep bass, spirituality, and personal experiences—came to life in her 2022 debut EP Mind & Body, which showcased her ability to blend genre-defying elements with emotive storytelling. Zingara’s music is not only an auditory experience but also a reflection of her personal growth and the profound connections she has cultivated with her listeners. Her performances, which have included sets alongside artists like Subtronics, Level Up, and Slander, have cemented her status as a rising star in the bass music world. Her trajectory has been nothing short of impressive, performing at festivals like Big Dub Festival and continuing to share her evolving sound across platforms such as Spotify and SoundCloud. Zingara’s work is as much about the journey as it is about the sound, embodying the spiritual and personal elements that have shaped her path. As she continues to push boundaries and evolve, Zingara stands out as an artist who is not only shaping the bass music landscape but also connecting with her audience on a deeply authentic level.",
        "Genres": "EDM, DJ, Bass",
        "Scheduled": "Sunday",
        "Stage": "The Other",
        "StartTime": "4:15 PM",
        "EndTime": "5:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "112",
        "Artist": "Of the Trees B2B Tape B",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "Infinity Stage",
        "StartTime": "8:30 PM",
        "EndTime": "9:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "113",
        "Artist": "Parisi",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "Infinity Stage",
        "StartTime": "7:00 PM",
        "EndTime": "8:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "114",
        "Artist": "Rebecca Black (DJ Set)",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "Infinity Stage",
        "StartTime": "10:00 PM",
        "EndTime": "11:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "115",
        "Artist": "Tinzo + Jojo",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "Infinity Stage",
        "StartTime": "5:30 PM",
        "EndTime": "6:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "116",
        "Artist": "Tractorbeam",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "Infinity Stage",
        "StartTime": "1:00 AM",
        "EndTime": "2:00 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "117",
        "Artist": "Big Gigantic (DJ Set)",
        "Description": "Big Gigantic, the Boulder, Colorado-based duo, has been a cornerstone of the live electronic music scene since their formation in 2008. Comprising Dominic Lalli on saxophone and production and Jeremy Salken on drums, Big Gigantic has carved out a unique niche by blending jazz, hip-hop, funk, and dubstep into an infectious and boundary-pushing sound. Their music is a testament to their genre-defying approach, with each track seamlessly combining sophisticated musicality with an irresistible, danceable energy that’s made them a favorite on the festival circuit. Their breakthrough came with the release of Brighter Future in 2016, an album that encapsulates their mission to unite the world through music and community. Featuring collaborations with a diverse range of artists like Waka Flocka Flame, Logic, Cherub, Griz, and Pell, Brighter Future is a bold statement of Big Gigantic’s ability to transcend genres and bring together people from all walks of life through music. Their distinctive sound, which blends live instrumentation with electronic beats, has earned them critical acclaim and a devoted fan base, as well as a reputation for their high-energy live performances that continue to captivate audiences. Big Gigantic has always been about more than just music—they’re a movement. From their early days in Boulder to their present status as pioneers of live electronic music, they’ve stayed true to their vision of creating moments of joy and connection. With their commitment to pushing musical boundaries, Big Gigantic continues to evolve, and their influence in the scene only continues to grow.",
        "Genres": "EDM, DJ, Saxophone, Bass, Funk",
        "Scheduled": "Saturday",
        "Stage": "Infinity Stage",
        "StartTime": "6:30 PM",
        "EndTime": "7:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "118",
        "Artist": "Blacklizt",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "Infinity Stage",
        "StartTime": "1:45 AM",
        "EndTime": "2:45 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "119",
        "Artist": "Cameron Winter",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "Infinity Stage",
        "StartTime": "3:00 PM",
        "EndTime": "3:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "120",
        "Artist": "Mary Droppinz",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "Infinity Stage",
        "StartTime": "4:45 PM",
        "EndTime": "5:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "121",
        "Artist": "Melt",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "Infinity Stage",
        "StartTime": "1:30 PM",
        "EndTime": "2:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "122",
        "Artist": "Saxsquatch",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Saturday",
        "Stage": "Infinity Stage",
        "StartTime": "11:00 PM",
        "EndTime": "12:00 AM",
        "Favorited": "0"
    },
    {
        "AOTD #": "123",
        "Artist": "Arooj Aftab",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "Infinity Stage",
        "StartTime": "5:30 PM",
        "EndTime": "6:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "124",
        "Artist": "Photay",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "Infinity Stage",
        "StartTime": "2:00 PM",
        "EndTime": "2:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "125",
        "Artist": "Post Sex Nachos",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "Infinity Stage",
        "StartTime": "3:45 PM",
        "EndTime": "4:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "126",
        "Artist": "Washed Out",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Sunday",
        "Stage": "Infinity Stage",
        "StartTime": "9:45 PM",
        "EndTime": "10:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "127",
        "Artist": "Levity",
        "Description": "Levity, an electronic trio born out of the creative collision between Chicago’s John Hauldren, Los Angeles’s PJ Carberry, and Minnesota’s Josh Tarum, has made waves in the music scene with a sound that effortlessly blends upbeat drums, atmospheric synths, and infectious melodies. Emerging with a fresh energy, their music has captivated listeners worldwide, accumulating over 3 million streams across platforms. Formed with a shared vision of producing electrifying soundscapes that invite listeners to escape reality, Levity’s tracks push the boundaries of electronic music while remaining accessible. Known for their invigorating live performances, the trio has garnered a reputation for engaging the crowd, creating an immersive experience that goes beyond just the music. Their performances are a journey, one that invites fans into their world of euphoria, rhythm, and vibrancy. Levity’s versatility has caught the attention of some of the biggest names in music, with the trio landing official remixes for artists such as Tinashe, Louis The Child, Quinn XCII, Chelsea Cutler, and Silent Child. These collaborations helped to expand their reach and solidify their reputation as a go-to creative force in the electronic scene. As Levity continues to grow and evolve, their ever-expanding fanbase is eagerly anticipating the next chapter in their musical journey. With a distinctive sound and undeniable presence, Levity is undeniably one to watch.",
        "Genres": "EDM, DJ, Trap, Bass, Dubstep",
        "Scheduled": "Saturday",
        "Stage": "Infinity Stage",
        "StartTime": "8:30 PM",
        "EndTime": "9:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "128",
        "Artist": "Zingara",
        "Description": "Zingara, born Gabrielle Mirabile on September 13, 1998, in Maryland, has rapidly made a name for herself as a dynamic force in the world of bass music. Initially encouraged by a friend to explore music professionally, Zingara’s journey began in 2017, when she pivoted from videography to DJing, performing in local venues around Towson, Maryland. This transition marked the beginning of a creative evolution that would see her become a prominent figure in the bass music scene. Her unique sound—intertwining deep bass, spirituality, and personal experiences—came to life in her 2022 debut EP Mind & Body, which showcased her ability to blend genre-defying elements with emotive storytelling. Zingara’s music is not only an auditory experience but also a reflection of her personal growth and the profound connections she has cultivated with her listeners. Her performances, which have included sets alongside artists like Subtronics, Level Up, and Slander, have cemented her status as a rising star in the bass music world. Her trajectory has been nothing short of impressive, performing at festivals like Big Dub Festival and continuing to share her evolving sound across platforms such as Spotify and SoundCloud. Zingara’s work is as much about the journey as it is about the sound, embodying the spiritual and personal elements that have shaped her path. As she continues to push boundaries and evolve, Zingara stands out as an artist who is not only shaping the bass music landscape but also connecting with her audience on a deeply authentic level.",
        "Genres": "EDM, DJ, Bass",
        "Scheduled": "Sunday",
        "Stage": "Infinity Stage",
        "StartTime": "7:15 PM",
        "EndTime": "8:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "129",
        "Artist": "DJ Python",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Thursday",
        "Stage": "Infinity Stage",
        "StartTime": "3:15 PM",
        "EndTime": "4:15 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "130",
        "Artist": "Airrica",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Infinity Stage",
        "StartTime": "1:45 PM",
        "EndTime": "2:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "131",
        "Artist": "Kamino",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Infinity Stage",
        "StartTime": "3:15 PM",
        "EndTime": "4:00 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "132",
        "Artist": "Omnom",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Infinity Stage",
        "StartTime": "5:00 PM",
        "EndTime": "5:45 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "133",
        "Artist": "Ayybo",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Infinity Stage",
        "StartTime": "6:45 PM",
        "EndTime": "7:30 PM",
        "Favorited": "0"
    },
    {
        "AOTD #": "134",
        "Artist": "it's murph",
        "Description": "Bio has not been defined",
        "Genres": "Unknown Genres",
        "Scheduled": "Friday",
        "Stage": "Infinity Stage",
        "StartTime": "11:00 PM",
        "EndTime": "12:30 AM",
        "Favorited": "0"
    }
]